[
  {
    "path": "posts4/2021-10-30-사망률 위험조정 측정/",
    "title": "사망률 위험조정 측정",
    "description": "LC모델에서부터 위험조정 측정까지",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-10-30",
    "categories": [],
    "contents": "\r\n서론\r\nLC모델에 관한 계수 추정 방법은 지난 9월 24일 1차 발표를 통해 충분히 이해할 수 있었다. 2차 발표는 논문의 결과값을 산출하는 것인데 LC모델의 경우 R패키지로 어렵지 않게 구현할 수 있기 때문에 사망률 예측을 통한 보험부채 산출은 큰 의미가 없어 보인다. 그렇기에 LC 모델을 활용해 사망률의 위험조정을 산출하는 2번째 논문으로 이어가는 것으로 가닥을 잡게 되었다. 발표일은 11월 3일 수요일로 대학원에서의 마지막 발표에 해당한다. 지난 대학원 석사 2학기에 해지율 시나리오 산출과 관련된 논문을 통해 헐-화이트 모델을 통한 해지율 시나리오를 산출해 보았고 지급준비금에 관하여서는 석사학위논문 작성을 통해 지급준비금의 예측분포 산출을 하므로 지급준비금과 관련된 위험조정금액 산출을 실습해보았다. 잔차를 활용한 부트스트랩 방법과 베이지안 모델을 활용한 MCMC기법을 모두 사용하였는데, 사망률 시나리오 산출에도 이러한 방법론이 동일하게 사용된다.\r\n방법\r\n먼저는 LC모델을 명확하게 이해해야한다. 1차 발표 논문인 “사망률 개선이 책임준비금에 미치는 영향”을 통해 LC모델의 모수 \\(\\alpha_{x}\\)와 \\(\\beta_{x}\\) 그리고 \\(k_{t}\\) 추정과 예측을 알 수 있다. 두번째로 LC모델을 활용하여 사망률 시나리오를 산출해야하는데 2013년 논문인 김세중 “장수리스크 측정방식에 관한 비교 연구”를 활용할 수 있다. 이 논문에서는 Koissi 2006년 논문을 활용하는데 여기에서 실제 데이터를 활용한 사망자수 \\(D_{s,t}\\)와 LC 모델을 통해 추정한 \\(\\hat{D}_{s,t}\\)에 관한 피어슨 잔차를 구하고 이를 복원 추출하여 가상의 사망자수 데이터 셋을 여러개 만들어낸다. 이를 통해 가상의 사망자 수 데이터를 LC모델에 재적합시켜 \\(\\alpha_{x}\\)와 \\(\\beta_{x}\\) 그리고 \\(k_{t}\\)를 추정할 수 있고 이를 바탕으로 사망률 시나리오를 여러개 만들어 낼 수 있다.\r\n추세 위험과 변동성 위험\r\n사망률에 관하여서 3가지 위험이 존재한다. 수준위험, 추세위험, 변동성위험. 수준위험의 경우 사망률 추정 대상의 차이로 인해 두 집단 사망률의 전반적인 수준에 차이가 나타나면서 발생하는 위험이다. 예를 들어, 국민 경험생명표와 보험회사의 보험계약 가입자 데이터를 활용한 경험사망률간의 차이를 들 수 있고 보험회사가 보험계약 가입자 데이터를 활용하지않고 국민경험생명표를 활용할 경우 직면 할 수 있는 위험이 수준 위험이다. 추세위험의 경우 보험부채의 최선추정치 계산에 사용된 미래 사망률 추세의 불확실성에 의해 발생한다. 미래 사망률 개선 추세는 주로 과거 개선추세를 반영하여 예측하며, 실현된 사망률 개선이 예측된 추세를 벗어나는 경우 보험회사는 지속적인 손실에 직면할 수 있다. LC모형에서 \\(k_{t+1} = k_{t} + \\lambda + \\epsilon_{t}\\) 식에서 추세위험을 유발하는 것은 \\(\\lambda\\)의 불확실성이다. 변동성리스크의 경우는 예측오차 \\(\\epsilon_{t}\\)의 표준편차 \\(\\sigma_{t}\\)가 유발요인이다.\r\n위험조정산출\r\n사망률 시나리오를 여러개 생성한 뒤 이를 이용해 보험상품의 부채를 구하게 되면 시나리오 만큼의 보험부채가 생성되고 이를 통해 보험부채의 경험적 분포를 구할 수 있고 평균금액과 VAR를 활용하면 위험조정금액을 산출할 수 있다. 추세 위험만을 반영하려면 잔차 부트스트랩기법을 활용하여 가상 사망자 수 데이터 셋을 만들어 LC모형에 재적합 시킨 뒤 미래 사망률의 기대값을 산출하여 사용하면 되고 변동성위험까지 모두 반영하려면 재적합 시킨 뒤 \\(k^{i}_{t}\\)를 표류항(drift)로 갖는 임의보행 모형으로 모형화한 후 미래 사망률 시나리오를 생성하면 된다.\r\n\r\n\r\n\r\nFigure 1: 논문들\r\n\r\n\r\n\r\n\r\nFigure 2: 논문들\r\n\r\n\r\n\r\n\r\nFigure 3: 논문들\r\n\r\n\r\n\r\n\r\nFigure 4: 논문들\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-19T20:11:13+09:00",
    "input_file": {}
  },
  {
    "path": "posts4/2021-09-20-사망률 모형을 이해를 위한 사전 작업/",
    "title": "사망률 모형 이해를 위한 사전 작업",
    "description": "앞선 3가지 논문을 관통하는 핵심.",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-09-20",
    "categories": [],
    "contents": "\r\nIntroduction\r\n미래 사망률을 예측하는 모형으로 다루게될 2가지 모형으로 Lee-Chater 모델과 2요인 평균회귀 모델이 있다. 이 모델에 대한 이해를 명확하게 하고 이 모델들에 베이지안 구조를 부여하여 MCMC기법을 통해 각 모수들의 사후 분포를 추정하면 모수 세트들을 얻을 수 있고 이를 활용해 다수의 미래 사망률 시나리오를 추정할 수 있다. 하지만 이 아이디어를 구현하는 것은 또 다른 문제라고 생각된다. 석사학위논문 주제였던 지급준비금 예측 분포 산출 주제에 있어서 MCMC기법을 활용하여 지급준비금에 대한 통계적 모델 속 모수들의 사후분포 추정 및 샘플링을 진행하였고 다수의 지급준비금 산출을 바탕으로 겅험적 분포를 산출해 이를 예측 분포로 보아 평균 지급준비금과 위험조정금액을 산출할 수 있었다. 동일한 프로세스가 진행될 것이라 볼 수 있다.\r\n선행 연구에 대한 이해 필요성\r\n사망률 모델에 대한 국내의 선행연구들을 읽어 나가야 앞서 제시한 3가지 논문들의 산출 결과를 볼 수 있을 것이다. 핵심을 사망률 모델에 대한 이해와 산출이 겠지만 그외에도 조재훈 교수님께서 작성하신 3번째 논문의 장수리스크 측정을 위한 장수채권에 대한 이해도 필요해 보인다. 물론 앞으로 도입될 K-ICS 4.0을 참고하면 장수리스크 관련 위험액 측정의 경우 전 보험기간 사망률 17.5% 감소시 순자산가치 변동액으로 측정하지만(즉, 충격 방식이다) 논문 상 장수리스크 측정에 장수 채권을 이용한 방법을 활용한 것을 볼 수 있다.\r\n\r\n\r\n\r\nFigure 1: K-ICS 4.0 장수리스크 측정\r\n\r\n\r\n\r\n\r\nFigure 2: K-ICS 4.0 장수리스크 측정\r\n\r\n\r\n\r\n선행연구들\r\n\r\n\r\n\r\nFigure 3: 선행연구 모음\r\n\r\n\r\n\r\n\r\nFigure 4: 선행연구 모음\r\n\r\n\r\n\r\n\r\nFigure 5: 선행연구 모음\r\n\r\n\r\n\r\n\r\nFigure 6: 선행연구 모음\r\n\r\n\r\n\r\n\r\nFigure 7: 선행연구 모음\r\n\r\n\r\n\r\n\r\nFigure 8: 선행연구 모음\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-19T20:11:13+09:00",
    "input_file": {}
  },
  {
    "path": "posts4/2021-09-15-2021년 하반기 프로젝트/",
    "title": "2021년 하반기 프로젝트",
    "description": "사망률 관련 3가지 논문 정리 및 결과 산출.",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-09-15",
    "categories": [],
    "contents": "\r\nIntroduction\r\n2021년 하반기 ASA과정 중 FAP를 2022년 1월 까지 마무리하고 12월 PA 응시를 목표로 준비하고 있다. 대학원 석사 마지막 학기를 보내고 있는데, 보험 회계 및 실무 강의에서 다루게된 사망률관련 3가지 논문 중 1가지는 강의 중 발표를 맡게 되었다. 나머지 2가지 논문에 대해 미련이 남아 이번 하반기 동안 발표하게된 1가지 논문과 나머지 2가지논문을 정리하여 홈페이지에 포스트 해보고자 한다. 담당하게된 3가지 논문은 아래와 같다.\r\n주효찬, 이항석(2014) 사망률의 개선이 책임준비금에 미치는 영향 -> 이번 학기 발표\r\n\r\n박규서 (2018) 국제회계기준(IFRS17)하에서의 사망률 위험조정 평가\r\n\r\n조재훈(2020) 확률론적 이자율과 사망률 모형을 이용한 보험리스크 측정\r\n\r\nFirst Contact\r\n1번 논문의 경우 Lee-Charter 모델을 이용하여 개선 사망률을 예측하고 이를 활용해 경험생명표를 작성하고 종신보험과 종신연금의 책임준비금을 산정해보고 이를 국민경험생명표에 의해 산출된 책임준비금과 비교해보는 내용이 주를 이룬다. 핵심을 Lee-Charter 모델이며 이 논문을 통해 Lee-Charter 모델을 명확하게 이해하고 R을 활용해 산출해 볼 수 있을 것이라 예상된다.\r\n2번 논문의 경우 1번논문과 동일하게 Lee-Charter 모델을 이용하는데, 사망률에 의한 위험조정금액을 산출해야 하기 때문에 1번논문과 다르게 Lee-Charter 모델을 통해 여러개의 사망률 예측 시나리오를 산출해야 한다. 산출된 여러개의 시나리오를 바탕으로 각각 경험생명표를 작성한 뒤 이를 활용하여 각각의 책임준비금을 산출하게 되면 책임준비금의 경험적 분포를 구할 수 있다. 지급준비금의 Stocastic Reserving과 마찬가지로 책임준비금의 경험적 분포를 산출하여 Percentile을 구하고 이를 분포의 평균값에서 빼주게 된다면 이 값이 신뢰수준기법에 의해 산출한 사망률에 의한 위험조정금액이 된다. 핵심은 Lee-Charter 모델을 활용하여 여러개의 위험률 시나리오를 산출하는 것과 이를 활용하여 경험생명표 제작 및 각각의 준비금 산출을 하기위한 VBA 혹은 R 코딩이 필요하다는 것.\r\n3번 논문의 경우 보험리스크 측정을 위해 이자율 모델(Hull-White), 사망률 모델(이요인 평균회귀 모델)을 각각 이용하여 시나리오를 산출하고 이를 바탕으로 보험리스크를 측정한다. 이자율 모델을 바탕으로한 이자율 시나리오 산출(석사 2학기 때에 Hull-White를 활용한 해지율 시나리오를 산출해본 경험이 있다.), 사망률 모델을 바탕으로 한 사망률 시나리오 산출(이요인 평균회귀 모델 - 논문을 작성하신 조재훈 교수님께서는 이요인 평균회귀모델을 연구하신 논문을 이전에 작성하였다. 즉, 레퍼런스를 바탕으로 보험리스크를 측정에 이요인 평균회귀모델을 활용 할 수 있으신 것… 그렇기에 앞서 논문에서 사용하여 익숙하게 될 Lee-Charter 모델을 적용하여 사망률 시나리오를 산출해 보고자 한다.) 이 두가지가 먼저이다.\r\n결론\r\nFAP는 순조롭게 완료 될 것으로 보이고, PA 또한 이번학기 상대적으로 여유로워 충분한 시간을 들일 수 있으며 그렇기에 합격에 자신감이 있다. 학기 강의 중 발표하게 된 사망률 관련 논문 중 2가지 논문을 안할 수는 없기에 심심할 때, 시간 쪼개서 진행하려고 이렇게 결심하게 되었다. 2022년 3월까지도 지속될 수 도 있어 보인다. ㅎㅎ\r\n\r\n\r\n\r\nFigure 1: 3가지 논문\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-19T20:11:13+09:00",
    "input_file": {}
  }
]
