[
  {
    "path": "posts2/2021-12-12-대학원 마지막/",
    "title": "석사과정의 마무리",
    "description": "보험계리학",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-12-12",
    "categories": [],
    "contents": "\r\n서론\r\n석사과정의 마무리를 눈앞에 두고 있다. 2019년도 말에 생명보험사 구직에 실패하고 인턴을 할지 대학원에 진학할지 고민을 했었다. 보험계리학 자체에 관심이 있었기에 국내의 석사과정 진학을 하게 되었고 4학기동안 많은 것들을 배웠다. 함께 공부했던 분들을 생각하면 각자가 목표를 가지고 오셨던 것 같다. 자격증 취득을 하고 이를 발판으로 취업을 하고자 하는 분. 직장에서 대학원에 보내주어 쉬러 오셨다는 분. 무엇을 하러 왔는지 모르겠는 분. 논문 면제를 통해 3학기 만에 빠르게 원하는 직장에 취업을 한 분 등등. 나의 목표는 무엇이엇을까 생각한다면 처음엔 한국시험을 마무리 해야겠다는 생각도 있었지만 공부를 하다보니 보험계리학 전반에 걸친 다양한 논문들을 접해볼 수 있었다는 것이다. 그리고 이를 바탕으로 석사학위논문을 작성하고 본심사를 통과했다. 한국자격증의 경우 취득에 별 미련이 없기에 미국자격증을 취업 후에 1년 반 정도를 들여서 마무리 하고자 한다. 보험계리학 전반에 걸친 다양한 지식들을 습득했기에 솔직히 미국자격증의 경우 시간만 들이면 충분히 취득할 수 있어보인다. 필기 시험의 경우 1과목 정도 남았고 온라인 모듈이 2개 R을 활용한 시험 PA가 하나 남아서 예상컨데 30살 정도에는 취득할 수 있지 않을까라는 예상은 하고 있다. ASA과정인데 그 이후에 FSA를 취득할지는 그때 가서 고민해야 할듯 헌데 FSA 트랙자체가 3~4개의 시험을 패스해야하고 준수한 영어 실력이 필요하기 때문이다. 석사학위논문 주제 자체도 FSA GI트랙의 한 꼭지로 썻다. 초고 쓰는데 까지 6개월 걸렸으니 보통 시험하나 패스하는데 1년정도 잡고 공부를 해야하는 것으로 보인다.\r\n삶에 태도에 관하여\r\n대학원에서 다양한 가치관의 대립을 보았다. 대학원 무용론과 스스로 계속해서 싸워야 했다. 왜 나는 대학원에 와서 이렇게 고생을 하는가? 팀플을 할때에도 팀원 분들께 별 의욕을 느낄 수 없었다. 그저 적당히 하자. 넘어가자라는 느낌… 비난의 여지는 전혀 없다. 그 모든 것이 각자의 인생 플랜 안에서 돌아가는 것이니,,, 나같은 경우는 4학기 수업을 충실히 수강했다라고 자신한다.\r\n리더십에 대하여\r\n대학원에서 리더십에 대해서 배울 수 있었다고 생각한다. 회사생활에서 필요한 리더십은 뭘까라는 고민을 많이 했었다. 계리학 공부를 하면서도 결과적으로 취업을 하여 실무에 뛰어들 터이니, 다양한 팀프로젝트를 하면서 나름 고민을 했엇는데 결과적으로 내가 내린 결론은 윗 사람께 잘하고 후배분들 개기는 거 잘 다독이며 일이 성사되도록 잘 이끄는 것이다. 이게 참 어렵다. 나 스스로 열심히만 한다고 되는게 아니다. 손해볼 각오를 해야한다. 그래야지 사람들이 따라온다. 성인이 되서 사회에서 만나게 되면 각자 손해 안 보고 소위 호구 안되겠다고 열심히들 눈치를 보는 것 같다. 맞는데, 리더십의 부재가 참으로 안타깝다고 생각한다. 누구는 리더병이라고 하던데 이러한 생각을 가지신 분께는 이렇게 대답해 주고 싶다. 한번 사시는 인생인데 비참하게 그저 톱니바퀴가 되어 살 것인지 자신이 함께 일하는 동료와 부하직원, 윗사람께 좋은 영향을 끼치며 성과를 내고 자신이 속한 조직과 사회를 발전시키며 갈 것인지… 인생에 대한 가치관이고 동기부여 측면이다. 일에 대해 돈만 보고 뛰어들게 된다며 분명 한계가 존재한다. 의미, 성장, 가치에 대해서 얘기하지 않으며 우리는 정체된다. 분명하게 정체된다. 연습이고 훈련이다. 어디를 가던지 계속해서 나를 가꿔가야한다. 안락함에 취하여 자신을 방치하지 말라. 새로운 동기부여, 새로운 도전. 새로운 의미가 필요한 시점이다.\r\n졸업\r\n취업을 해야하는데 쉽지 않다. 한국시험이 2018년도 부터 2022년도 까지 각 과목 합격률 50%를 유지하기 위해 소위 쉬워지면서 계리사 공부를 하시는 많은 분들이 유입되었다. 한편 취업 시장 각 재보사,원수사, 공제회, 은행 등과 로컬, 글로벌 컨설팅사 들의 TO가 이를 모두 다 흡수하지 못하는 실정이다. 많이 못 미친다. 또한 계리사 자격증을 통해 소위 법적인 업무영역을 보장받는 것이 아니다. 즉, 계리사 자격증이 없어도 업무하는데에는 크게 문제가 없다는 것이다. 대학원에서 상품관련 엑셀 시트를 가지고 1학기 수업을 진행 하였을 때에도 또한 프로펫 소프트웨어를 사용하였을 때에도 계리학을 전공했다고 한들 큰 의미가 없다라는게 내 결론이 었다. 시험 공부를 통해 전반적인 내용을 학습하고 실무에서 소프트웨어 활용역량 키워서 업무에 투입되면 큰 문제가 없어보인다. FSA 트랙의 지식이라는 것도 실무를 하면서 취득하도록 과정이 설계되어있다. 즉, 계리학은 실무를 바탕으로 발전했다. 개인적으로 이러한 이유때문에 한국계리사 시험을 준비하다가 미국계리사시험으로 전향한 부분이 있다. 한국 시험의 경우 각 트랙에 대해 깊이 있게 배우지는 못한다. 물론 어려운 시험이지만 예를 들어 연금 분야의 전문가가 되겠다라는 생각을 가진 학생이라면 한국보험계리사 시험의 연금수리학 과목을 수험용 서적과 함께 준비하여 합격 한다고 해서 전문가가 되는 것이 아니라는 의미다. 가성비를 원한다면 한국보험계리사, 깊이를 원하며 사서 고생하겠다라는 사람들은 SOA를 취득해야한다고 생각한다.\r\n결론\r\n이 글을 마지막으로 이 홈페이지에 더 이상의 업로드는 없을 것이다. 내 대학원 2년이 고스란히 남겨져 있는 아카이브로서의 역할을 하는 곳이고 나의 삶에 있어 27-28에 무엇을 했는지 생각날 때마다 이 홈페이지를 찾아와 다시 볼 목적으로 만든 것이다. 물론 자기소개서에 홈페이지를 기입하여 내가 했던 포트폴리오를 보여주는 목적도 있기는 했다. 어찌보면 장님이 코끼리 다리를 더듬는 듯한 과정의 연속이었다. 한 외국계 생보사 면접 때에 나에게 현업에 계시는 선배분 없으시냐라고 면접관께서 물은 기억이 난다. 공부를 해가며 몇 분을 알게 되었지만 이 질문의 의미는 나에게 뭐하러 이렇게 사서 고생했느냐, 취업이 목적이 었으면 분명 빠른 길이 있었을 텐데 너가 정보가 부족해서 그런 것이 아니었느냐라는 질문으로 느껴졌다. 반은 맞고 반은 틀린다라고 생각이 들었다. 앞서서 얘기했지만 대기업에 취업하는 것이 과연 인생의 목표가 될 수 있는가라는 고민을 해봐야한다라고 생각한다. 계리를 하고 싶어 온 것이지 대기업에서 높은 연봉을 받는 것이 나의 목표는 아니다. 허울보단 일을 쫒아야한다. 로컬, 글로벌 컨설팅사 혹은 원수사, 재보사 등등 보험업계 전반적으로 계리적 지식이 사용되는 어디는 상관은 없다. 내가 쌓아왔던 지식들에 실무적 경험들을 더하고 싶을 뿐이다. 이론적으로는 기회가 된다면 FSA가 되고 싶다. 한편 석사학위논문 전자파일 등재를 마쳤다. 통과되고 인쇄하여 교수님들 싸인 받고 제출하면 끝난다. 2월정도에 RISS 내이름 검색하면 나온다. 손성만 검색해보길 ㅋㅋ\r\n교훈\r\n보험계리와 리스크에 대해서 학습하면서 궁극적으로 얻은 교훈 : 정보비대칭성은 궁극적으로 시스템리스크를 유발하며 시스템의 붕괴는 사람들의 피를 먹고 복구된다. 그러니 정보비대칭을 제거하는 역할과 책임이 몹시 중요하다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-12-19T19:40:36+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-10-22-정통과 바깥/",
    "title": "정통과 바깥",
    "description": "공간성에 관하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-22",
    "categories": [],
    "contents": "\r\n서론\r\n제도권이라는 말의 의미는 정통성을 의미한다. 정통성을 얻는 다는 것은 기존의 체계와 규범, 규율을 받아 드린다는 것이다. 훈련받는 것이다. 이것이 필요한가? 필요하다. 우리의 삶에서 그렇다면 무엇을 믿을수 있다는 말인가. 또한 시스템을 고치는 것은 시스템을 이해하는 사람들이다. 시스템을 훈련받은 사람들이다. 그러나 정통성은 공간성을 갖는다. 바깥이 있기에 인사이더가 있다. 주변이 있기에 중심이 있다. 모든 사람들이 중심을 향해 뛰어드는 풍경은 어떤 의미를 갖는가?\r\n새로움에 관하여\r\n바깥은 차가움의 공간이고 낯섬의 공간이자 새로움의 공간이다. 정통의 문법이 통하지 않는 곳. 정통이 필요 없는 곳.\r\n역전\r\n정통이 바깥이 되고 주변이 중심이 되어가는 모습을 본다. 주변이 다수고 정통이 소수다. 훈련을 받는 다는 것은 굉장한 비용이 투입되는 과정이다. 그렇기에 인력난에 시달린다.\r\n균열\r\n시스템을 운영하고 개선해 가는 것은 정통성이 있는 사람들이다. 하지만 그들에겐 새로움이 필요하다. 이러한 새로움은 어디서 오는가? 바깥에서 온다. 정통성을 얻기 위해 훈련받은 사람들은 시스템속으로 들어가 다시 바깥을 주시해야한다. 자신에게 주어진 책임을 다하는 것은 시스템의 한계를 보고 새로움을 고민하는 것까지. 즉, 자신의 자리를 점점 지워가는 것. 새로움을 예비하는 것.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-22T13:19:01+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/",
    "title": "이해관계자",
    "description": "이해관계에 관하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-17",
    "categories": [],
    "contents": "\r\n고찰\r\n계리사의 업무는 다양한 이해관계자가 얽혀있는 문제에 있어 해결책을 제시하는 것이다. 모든 문제는 다양한 이해관계가 반영되어 있다. 각각의 이해관계자는 자신의 입장이 존재한다. 그들이 추구하는 가치를 명확하게 아는 것이 문제 해결의 출발점이다. 이는 권력의 핵심과도 일맥상통하다. 권력, 혹은 영향력은 상대방이 추구하는 가치를 명확하게 이해하고 상대방이 원하는 것을 주는 것과 동일하다. 돈, 명예, 자신의 자리, 취업, 주색등 개인의 차원을 넘어서 조직의 법적 다툼에 대한 법적 승리, 정치적 영향력 상승 등.\r\n해결책\r\n혹자는 상대와의 대화를 통해 상대의 생각 바탕의 가치를 읽어 내라 말한다. 혹자는 비즈니스적 마인드, 윈윈하는 파이나누기 식의 아이디어를 말한다. 혹자는 가치를 이야기한다. 보수 혹은 진보의 전통적 가치와 같은 것들. 옳다. 하지만 나는 앞서 언급한 사고 방식의 밑바탕에는 전형적인 서양식 사고틀이 자리잡고 있다 생각한다. 서양식 사고틀. 우리는 또다른 사고의 틀이 필요하다. 서양외에 어디에 있는가? 동양의 사고가 있다. 한국의 사고방식은 필히 서양에 뿌리 두고 있다 생각한다. 50년대 이후 국내의 대학강단은 대부분 서양에서 교육을 받은 선생님들이 학생들을 가르쳐왔다 생각한다. 우리가 다른 방식으로 문제를 바라보고자 한다면 우리는 동양식의 사고가 필요하다. 효용성에 관한 문제이다. 서양식 사고를 깊숙하게 훈련받은 사람들은 동양식 사고를 하는 사람들을 이해하지 못한다. 특히 계리사들은 전형적인 서양적 사고방식의 틀에 기초를 세운 학문에서 학습한 것. 복합적 사고가 필요하다. 이는 우리가 직면하는 문제의 복잡성에 기인한다. 생각의 뿌리, 우리가 받은 교육의 뿌리, 기틀을 깊이 생각할 필요가 있다. 깊은 고민이 필요한 시점이다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-17T15:44:16+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-10-09-지급여력제도에 관하여/",
    "title": "지급여력제도에 관하여",
    "description": "내재가치평가, IFRS17, 지급여력제도",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-09",
    "categories": [],
    "contents": "\r\n서론\r\n지급여력제도는 보험산업에서 내재가치평가, 국제회계기준(IFRS17, IFRS9)과 함께 주요한 재무정보를 산출하는 제도 중 하나이다. 지급여력비율은 보험회사의 재무적 건전성을 표현하는 수단이자 보험회사들 간의 경쟁력의 척도로서 활용된다. 앞서 언급한 3가지 제도를 하나의 통합된 시각으로 볼 수 있는 통찰을 한국보험계리사회에서 작년(2020년 5월)에 작성한 보험산업 신지급여력제도 및 관련제도 통합이해라는 보고서에서 볼 수 있다. 이 글은 해당 보고서와 계리사회에서 제공했던 11시간의 온라인 강의, 보험연구원 및 한국리스크관리학회의 공동세미나를 통해 이해한 내용을 정리, 기록할 목적을 갖는다.보고서의 경우 작년 7월, 계리사회 온라인 강의의 경우 올해 1월, 공동세미나의 경우 올해 7월에 수강하였다.\r\n목차를 통한 이해\r\n1장\r\n보험회사의 가치평가의 역사를 다루는데 각 제도 EV, 국제회계기준, 지급여력제도(Sol2, ICS, K-ICS) 별로 들여다 본다.\r\n2장\r\n자산과 부채의 가치평가에 대해 다룬다. 평가 원칙과 주로 보험부채의 평가 단위 및 평가에 대해 이야기한다.\r\n3장\r\n지급여력제도에 대해 알아본다. 특히 표준모형과 내부모형에 대한 논의를 볼 수 있어 좋다.\r\n4장\r\n손익 및 변동성 분석으로서 EV MOVE 분석과 IFRS 손익을 구분한다. 몹시 흥미롭다.\r\n5장\r\n제도변화에 따른 자본관리를 다룬다. 핵심은 지급여력제도와 각 보험사들의 자본관리전략이 결부된다는 것.두번째로 경영관리에서 신상품 수익성관리와 ALM(헷징, 공동재보험)을 다룬다.\r\n부록\r\nk-ICS할인율 산출 방법론, LLP, TVOG 산출방법, ESG(환경 사회 거버넌스가 아니다 ^^), PCA(SOL2의 금리리스크 산출에 사용되는 머신러닝 방법론), DNS와 AFNS 까지\r\n만찬\r\n읽을 거리가 너무 많고 보험산업의 넓이와 깊이를 보여주는 보고서이며 각 주제를 충분히 음미하며 공부해가는 것이 전문성을 갖춘 계리사가 되는 지름길이라 믿는다. 후에 보고서에 제시된 참고문헌에 해당하는 1차 자료들을 직접 찾아 보는 것이 필요하다 생각한다.\r\n\r\n\r\n\r\nFigure 1: 참고 자료\r\n\r\n\r\n\r\n\r\nFigure 2: 참고 자료\r\n\r\n\r\n\r\n\r\nFigure 3: 참고 자료\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-09T14:37:13+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-10-07-IFRS17/",
    "title": "IFRS17",
    "description": "수익성에 관하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-06",
    "categories": [],
    "contents": "\r\n서론\r\n대학원 수업에서 바뀌는 보험회계 기준에 대한 특강을 수강하게 되었다. IASB가 제시한 보험계약에 대한 회계기준인 IFRS17의 경우 IFRS4에서 IFRS17으로 23년 전환하게 되고 비교 공시를 위해 22년 부터 실제로 보험사들은 공시를 해야한다. 이번 특강에서 국내 H대학에 재직 중이신 교수님께서 관련 논문에 관한 특강을 해주셨다. 논문의 요지는 수익과 비용에 있어 IFRS17의 원천이 다르기에 수익성 정보가 뒤틀리므로 이를 보완할 수 있는 부분이 필요하다는 것으로 이해했다. 교수님께서는 IFRS17이 굉장히 실무적인 부분에 있어 많은 논란과 이슈를 내포하고 있으며 이를 위해 많은 논의가 필요하다 주장하셨다. 이 글은 특강의 내용을 내 스스로 복기하며 소화한 것을 기록할 목적을 갖는다.\r\n수익의 원천\r\nIFRS4의 경우 수입보험료가 현금으로 들어보면 곧바로 보험 수익으로 인식되는 구조였다. 하지만 IFRS17의 경우 수익의 원천은 3가지로 분류된다. 먼저 상품 손익인 CSM(보험계약마진)의 상각이다. 두번째로 위험조정(RA)의 상각이다. 세번째로 예상보험금과 예상직접사업비를 수익으로 인식한다.\r\n비용의 원천\r\nIFRS4의 경우 실제보험금과 실제사업비가 또한 책임준비금 전입액이 비용의 원천이었다. 반면 IFRS17의 경우 실제보험금과 직접 사업비, 간접사업비(바로 비용 인식) 이 비용의 원천이 된다.\r\n보험손익의 인식\r\nIFRS17에서 보험이익의 경우 3가지 측면에서 발생한다. CSM 상각, RA상각, 예상과 실제치의 차이로 언급되는 경험조정. 이 3가지가 보험이익으로 인식되고 투자이익의 경우 따로 인식하게된다.\r\nIFRS17의 수익성 정보 문제점\r\n교수님께서 논문에서 지적하신 문제점은 수익성 정보의 경우 CSM의 상각은 서비스(급부) 기반, 보험사건 발생확률 고려하지 않는반면 나머지 위험조정과 경험조정은 현금흐름 기반하여 보험사건 발생확률을 고려하기 때문에 수익 비용 대응과 이해가능성이 떨어진다는 것이다.\r\n\r\n\r\n\r\nFigure 1: IFRS17 관련 자료\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-07T18:08:38+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-10-03-Bias Variance Tradeoff/",
    "title": "Bias Variance Tradeoff",
    "description": "SRM과 PA 기초",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-03",
    "categories": [],
    "contents": "\r\n서론\r\nSOA과정 중 SRM을 통해 학습하게 되는 다양한 머신러닝 모델과 통계이론들, PA를 통해 직접 R로 분석하여 커뮤니케이션 문서를 제작하는 경험은 계리사의 실무적인 업무를 경험하고 준비하는 좋은 과정이라 생각한다. SRM을 통해 여러가지 모델들을 학습하게 되는데 여러 교재들이 있지만 SOA측에서 제시하는 2권의 참고서적 중 ISLR(Introduction to Statistical Learning with Applications in R)에서 제시하는 개념 중 Bias Variance Tradeoff의 개념을 이 글에서 논해보고자 한다. 온라인 상 해당 서적의 PDF파일이 풀려 있어 관련 내용을 함께 제시한다.\r\n트레이드 오프\r\n트레이드 오프라는 단어는 우리의 현실을 잘 나타낸다. 우리가 현실에서 풀어내야하는 문제는 절대 이상향이 존재하지 않는다. 즉, 모든 조건을 만족시키는 완벽한 솔루션은 존재하지않는다는 의미. 우리는 몇가지의 조건 속에서 특정 조건에 관한 만족수준을 올리려 한다면 타 조건에 관하여서는 희생이 필요하다. 문제를 정의하는 단계는 이러한 조건들을 명확하게 인식하고 추상화 시키는 과정. 그 이후 문제에 관한 솔루션을 제시한다는 것은 이 조건들의 함수관계를 이해하며 우리가 직면하고 있는 현실을 인식하여 적정한 함수적 관계를 제시하는 것이라 본다. 우리에게 필요한 것은 문제의 정의하고 추상화 시키는 것, 현실을 이해하고 그에 맞는 해결책을 제시하는 것, 그리고 그에 관한 해결책을 도입했을 때에 변화하는 상황을 모니터링하며 우리가 잡아내지 못한 변수들, 급변하는 현실 상황, 결과에 관한 우리의 예측과 실제의 차이를 분석하여 반영해가는 것이다.\r\n예를 들어 보자.\r\n공적 연금의 개혁에 관하여서 문제는 2가지 변수의 함수 관계로 정리할 수 있다. 급여적정성과 지속가능성의 함수. 급여수준은 소득대체율로 표현되며 지속가능성은 적정한 보험료를 통한 기금이 고갈되지 않고 적정하게 유지될 수 있도록 하는 것으로 생각할 수 있다. 정치적 논제는 문제의 핵심을 다른 언어로 표현한 것에 불가하다. 공적 연금의 기능인 사회적 재분배와 규모의 경제를 활용한 높은 투자수익률 추구는 공적 연금의 필요성을 주장하는 근거이지 문제의 핵심은 아니다.\r\nBias-Variance\r\n머신 러닝의 목적은 트레이닝 데이터 셋 \\(x_{i1}, .... , x_{ik}\\)에 대해 \\(i = 1, ..., n\\)이고 각 \\(x_{i1}, .... , x_{ik}\\) 에 대해 \\(y_{i}\\)가 존재할 때 실제 함수관계 \\(y_{i} = f(X) + \\epsilon_{i}\\)에 대해 \\(\\hat f\\)을 찾는 것이다. 이 때 MSE를 최소화하는 방법을 사용하는데 트레이닝 데이터에 대한 최소화 뿐 아니라 새로운 테스트 데이터에 대한 MSE도 최소화하는 것을 목적으로 한다.\r\nBias의 경우 모델을 간단하게(복잡하지 않게 flexible 하지 않게) 하였을 때, 그에 따른 가정이 잘못될 경우 발생 한다. 모델이 복잡할 수록 트레이닝 데이터에 적합되어 실제치와 모델에 의한 예측값의 차이가 적으므로 Bias는 0이 된다. Variance의 경우 트레이닝 데이터에 지나치게 fitting되어(매우 복잡, 높은 flexibility) 테스트 데이터에 대해 일반화되지 못하므로 발생하는 오류다. 트레이닝 데이터에 의해 학습한 모델에 새로운 데이터을 넣었을 때 산출되는 예측값의 변동성으로 생각할 수 있고 복잡한 모델일 수록 Variance는 커진다. 우리의 문제는 y에 관한 근사함수 \\(\\hat f\\)를 찾는 것인데, 이 \\(\\hat f\\)의 복잡성의 정도는 2가지 축 Bias와 Variance으로 표현된다. 이 두가지의 함수적 관계를 활용하여야 한다.\r\n\r\n\r\n\r\nFigure 1: ISLR 관련 자료\r\n\r\n\r\n\r\n\r\nFigure 2: ISLR 관련 자료\r\n\r\n\r\n\r\n\r\nFigure 3: ISLR 관련 자료\r\n\r\n\r\n\r\n\r\nFigure 4: ISLR 관련 자료\r\n\r\n\r\n\r\n\r\nFigure 5: ISLR 관련 자료\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-03T16:06:04+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-10-02-계리리스크관리에 관하여/",
    "title": "계리론과 리스크관리론",
    "description": "FIAK, Rate Making",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-10-02",
    "categories": [],
    "contents": "\r\n서론\r\n한국보험계리사 시험은 1차시험과 2차시험으로 구성된다. 2차 과목 중 가장 흥미로운 과목은 단연 계리리스크관리라는 과목이다. 계리론과 리스크관리론 2가지를 합쳐놓은 형태인데 매년 5~6문제에 대한 서술형 답안을 작성하므로 시험을 치루게 된다. 이 글은 각각의 계리론과 리스크관리론의 테마들을 간단하게 정리하는 목적을 갖는다. 참고 서적과 논문은 시중 서적인 황희대 저, 감창기 저, 강계욱 저와 이항석(계리리스크관리 동향) 논문 이다.\r\n내 머리 속 목차\r\n계리론은 황희대 저의 목차가 적절하다 생각한다. 설명은 내가 덧붙인것.\r\n보험과 보험계리사 (Insurance & actuary) : 민영보험과 사회보험, 보험계리사와 선임계리사제도를 다룬다.\r\n보험상품종류 (Product) : 보험상품의 종류, 생명, 손해, 제3보험, 신상품들\r\n보험상품개발 (Product development) : 상품개발부서에서 할일들 상품개발전반적인 과정, 위험률 산출, 상품개발시 고려할 다양한 위험들\r\n요율 (Pricing) : 일반적인 face value 상품들의 보험료 산출 방법, 실손보상 상품들의 요율 산출 방법\r\n준비금 (Reserving) : 보험료 적립금, 지급준비금, 미경과 보험료 적립금, 지급준비금 검증 방법, 보증준비금, 수익성 분석\r\n손익 및 배당 (Profit) : 손익분석, 배당관련적립금\r\n부채평가 (Valuation) : IFRS17과 EV 주제를 주로 다룸\r\n리스크관리론 또한 황희대 저 의 목차가 적절하다 생각한다. 대부분 비슷하다.\r\n리스크 : 리스크 정의, 도덕적 해이와 역선택, ERM, 기대효용이론\r\n보험리스크 : 장수리스크, 보험리스크의 원천 등\r\n보험리스크 전가 : 전통적 수단(재보험), 자기부담금, 다양한 조항들, ART\r\n금리리스크 : 정의, 원천, 이자율 기간구조론, 후순위채 및 신종자본증권, 관리 전략\r\n시장리스크 : VAR, 스트레스 테스트, 다양한 원천, 운영리스크까지\r\n지급여력제도 (RBC & K-ICS) : 지급여력제도의 역사, 계수방식 측정, k-ICS, Solvency2, ORSA, RAAS\r\n요율 산정에 관하여\r\nFace value를 갖는 상품에 관하여 일반적인 보험수리적 보험료 산출 방법이 적용된다. 위험률과 이자율, 사업비를 활용한 3이원 방식의 보험료 산출을 하는 것이다. 실무적인 측면에서도 시산보험료의 경우 3이원방식을 활용하고 이후 현금흐름방식을 활용하여 수익성 분석등을 한다. 실손 보상 상품의 요율 산정 방식은 다르게 구성된다. 보통 rate making 이라고 할 수 있는데 대표적으로 자동차 보험료, 기업성 보험 상품의 요율 산정이 이러한 방식으로 이루어진다. FIAK의 경우 계리모형론이라는 과목에서 단기 상품의 요율 산정에 관한 이론을 다루며 SOA는 STAM, CAS는 EXAM 5에서 다룬다. 보통 Basic한 수준에서 다루며 Advanced한 주제는 한국시험에서 커버하지 못한다. SOA의 팰로우 과정인 GI 트랙(내가 취득하고자하는 트랙)에서 CAS는 팰로우 과정인 EXAM 8에서 다룬다.\r\n읽어야 할 자료(내가)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-10-05T14:00:58+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-09-27-EV에 관하여/",
    "title": "EV에 관하여",
    "description": "TEV, EEV, MCEV",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m/"
      }
    ],
    "date": "2021-09-27",
    "categories": [],
    "contents": "\r\n서론\r\n장기 계약을 보유하고 있는 보험사들의 특성상, PBR이나 ROA와 같은 지표를 통한 보험사 가치 평가에는 한계가 있다. 이러한 점에서 일반적인 금융회사와 다르게 보험사들은 내재가치(embedded value)를 가치평가 지표로 이용하고 있다. 특히 내재가치 공시의 핵심으로서 1년간의 EV 변동성 분석은 전통적인 손익계산서를 대신하여 보험회사의 평가기간 내의 경영 실적을 보다 명확하게 나타내는 경영기법으로서 업계에서 사용되고 있다. EV 변동성 분석은 전기의 가치와 당기의 가치 차이를 다양한 요소로 분해하여 보여주는 것이다. 당기 가치와 전기가치의 차이를 내재가치이익(RoEV) 라고 하며 신계약가치, 경험실적 차이, 가정변경 효과 등의 구성요소로 이루어진다.\r\nEV의 역사\r\n최초의 내재가치 개념은 1959년 Jame Anderson의 논문에서 유래되었으며, 이후 유럽에서는 상장보험사의 평가를 위하여 전통적인 재무제표와는 별도로 내재가치 분석보고서의 공시에 대한 가이드 라인을 제시하여 내재가치를 공시하고 있으며 세계적인 보험사들이 IPO, M&A을 진행 할 때 사용되는 기준으로 회사 내부 성과 및 전략 지표로도 사용되고 있다.\r\nEV산출 방법\r\nTEV(Traditional Embedded Value), EEV(European Embedded Value), MCEV(Market Consistent Embedded Value)방법이 있다.\r\nTEV\r\n전통적 내재가치란 대상계약에 할당된 자산으로부터 발생되는 장래 배당 가능한 이익 중 주주 몫에 대한 현재가치를 의미하며 그 구성요소로는 조정순자산가치(ANW)와 보유계약가치(VIF)로 표현\r\nTEV = VIF + ANW = PVFP – CoC + RC + FS VIF : 보유계약에서 발생하는 미래수익의 현재 가치(PVFP) – 자본비용(CoC) ANW : 조정순자산가치란 순잉여금(Free surplus)가치와 요구자본(required capital)가치를 의미 이는 장부상 자기자본에서 준비금, 무형자산가치 등을 조정하여 계산된다. 조정항목으로는 합산항목 (배당 보험손실보전준비금,대손충당금, 비상위험 준비금) 차감항목 (영업권 등 무형자산, 선급비용, 지급 에정된 현금배당액) 순잉여금가치는 평가일 현재 보유계약에 할당되었지만 즉각적인 환입에 어떠한 제약도 없는 자본과 잉여금의 시장가치를 의미한다. 요구자본가치란 대상계약에 할당된 자산 중 부채초과 자산으로 주주에 대한 배분이 법적 혹은 내부적 요구에 의해 제한되는 자산을 의미한다.\r\n내재가치 결과는 장래 현금흐름 산출을 위해 사용된 가정들에 많이 좌우되는데 주요 가정으로는 경제적 가정과 계리적 가정이 있다. 경제적 가정: 투자수익률, 시장금리, RDR, 기대 배당률, 인플레이션 계리적 가정: 각종 위험률, 해약률, 사업비율, 계약자 행동등\r\nEEV\r\n내재가치 측정에관한 통일된 기준 마련과 리스크를 감안한 내재가치 측정 방법에 대한 필요성에 의해 CFO 포럼에서 유럽형 내재가치(EEV) 측정방법에 대한 기준을 마련하였다. EEV = TEV – FOG 비용\r\nFOG 비용 = 금융옵션과 보증 비용 확률론적 현금흐름분석을 통하여 옵션과 보증 가치를 산출하고 이를 명시적으로 반영\r\nMCEV\r\nVIF +ANW – FOG 비용 – FC(frictional costs) –CNHR(cost of non-hedgeable risks)\r\nFC : 요구 자본비용을 마찰 비용으로 칭하며 주주의 보험회사에 대한 투자로 인하여 발생하는 관련 비용으로 요구자본을 지원하고 있는 자산의 투자소득에 대한 세금과 투자관리비용을 의미\r\nCNHR : 보험계약부채에서 발생하는 현금흐름은 시장을 통하여 헤지가 불가능하므로 해지불가능한 리스크 비용은 부채 현금흐름의 불확실성에서 발생하며, 동 비용은 회사의 재량에 의해 다양한 방법을 이용하여 산출\r\n\r\n\r\n\r\nFigure 1: 참고논문의 표\r\n\r\n\r\n\r\n참고 논문\r\n유광욱,” 생명보험회사의 내재가치 변동성분석에 관한 연구 -경험실적차이를 중심으로-”, 한양대학교 일반대학원 석사학위논문, 2012\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-27T17:50:41+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-09-26-Empirical Evidence on Adverse Retention and Lapse in the Korean Private Health Insurance 번역/",
    "title": "실손의료보험의 역유지 현상과 해약률 실증분석 논문 번역 ",
    "description": "번역 완료 제출.",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-09-26",
    "categories": [],
    "contents": "\r\n1. 초록\r\n실손의료보험 시장은 급격한 성장기를 지나 성숙단계로 진입하고 있다. 또한 국민 건강보험의 보장범위 확대, 손해율의 구조적 상승과 같은 체계적 위협에 직면하고 있다. 이에 계약자 특성 및 상품 특성이 해약률에 미치는 영향을 분석하고 실손의료보험 시장의 역유지(adverse retention) 현상과 문제점을 살펴보았다. 실제 실손의료보험 계약자료와 청구자료를 사용해 현재 요율변수, 선택담보, 보험금 청구실적, 경과기간과 해약률에 대한 일반화선형모형 분석결과, 여성, 연령 증가, 보험금 청구자, 경과년수 증가, 낮은 상해급수일수록 해약을 적게 하는 것으로 나타났다. 특히 저위험군에 해당하는 보험금 비청구자(non-claimant)군과 고위험에 해당하는 보험금 청구자(claimant)군의 해약률 격차가 현저했는데, 이는 실손의료보험 시장의 역선택이 가입 단계에서만 나타나는 것이 아니라 해약 단계에서도 존재한다는 점을 시사한다. 역유지는 저위험군 탈퇴, 고위험군 유지의 계약자 이동을 야기하며 장기적으로 반복될 경우 가입 역선택과 마찬가지로 가입자 구성(policyholder mix)을 변동시켜 구조적 보험료 상승의 원인이 된다. 따라서 실손의료보험의 안정성을 위해 저위험군 비청구자 (no-claim) 가입자군의 계약유지 유인을 높이기 위한 제도적 고심이 필요해 보인다.\r\nThe Korean private health insurance market is currently moving in to the early mature stage and facing the systemic changes such as the structural premium hike due to aging population and the possibility of expanding coverages of national health insurance, which probably will constitute the exact substitutes. In this work, we analyze the impact of policyholder and product characteristics such as age, gender, level of injury, claimant and contract age on lapse in the Korean private health insurance industry using individual contracts data with generalized linear models(GLMs). We find that all considered policyholder and product characteristics have a statistically significant impact on the lapse rate, but the magnitude of the effects varies. Empirical results also show that the lapse tends to be low among the female, the elderly, the claimant, the old contract and the regular income earner. Also, we note that there is predominant difference of lapse rates between the claimant and the non-claimant, implying adverse retention, the other adverse selection at decrement. Adverse retention could trigger unfavorable policyholder dynamics: the more risker the less lapse and the less risker the more lapse, making the policyholder mix gravely undesirable. In conclusion, we suggest that the regulatory review to provide the low risk the incentive to retain their contracts be considered.\r\n2. purpose of the study\r\n이 연구는 실손의료보험의 계약자 특성 및 상품 특성이 해약률에 미치는 영향에 대한 실증분석이다. 사용된 자료는 실손의료보험 계약자료와 청구자료이며 방법론은 일반화선형모형이다. 본고는 그 동안 자료의 제약성으로 제한적으로 다루어졌던 실손의료보험의 계약자 특성과 해약률에 대한 면밀한 검토와 현 국면에서 실손의료보험 시장의 문제점 제기에 초점을 맞추고자 하였다. 실제 실손의료보험이 해약과 계약자 특성을 파악하는데 도움이 될 수 있을 것이며 다음과 같은 점에서 본 연구는 시의 적절성을 갖는다. 첫째, 실손의료보험이 성숙시장에 진입함에 따라 현 시점에서 실손의료보험 시장의 제도적 미비점을 규명하고 개선함으로써 기존 가입자의 제도 이탈을 낮추고 계약유지를 장기화할 수 있는 방안을 마련하는 것이 더 시급해 보인다. 둘쨰, 계약자 특성과 계약자 이동에 대한 분석결과는 실손의료보험의 제도적 안정성에 대한 재고가 필요함을 보여준다. 분석결과, 보험금 청구이력이 있는 가입자와 청구이력이 없는 가입자간 해약률 차이가 현저하였다. 이러한 현상을 역유지라 하는데 역유지는 가입단계뿐만 아니라 해약단계에서도 역선택이 발생하는 것으로 다기간에 걸쳐 반복될 경우 제도 존속에 위협요인이 될 수 있다. 해약률엔 관한 연구는 설명변수에 따라 구분된다. 하나는 Kuo, Tsai, Chen(2003)처럼 이자율, 실업률, 등 거시변수와 해약률간의 관계를 분석하는 것으로 이들은 긴급자금가설과 이자율가설을 검증하였다. 다른 하나는 개별 계약자료를 이용해 계약자 특성과 해약률간의 관계를 분석하는 것으로 Li, Jensen(2012) 은 2000~2008년 HRS자료를 이용하여 미국 장기요양보험(LTCI)의 해역률을 분석하였다. Eling, Kiesenbauer (2013)는 2000~2010년 기간의 생명보험 계약자료를 이용해 해약률에 영향을 미치는 상품유형 및 계약자 특성을 분석하였다. Christiansen, Eling, Schmidt, Zirkelbach (2014)는 2010년의 민영의료보험 계약자료를 이용해 상품유형 및 계약자 특성이 해약률에 미치는 영향을 분석하였다. 해약률에 대한 국내 선행연구로는 황진태, 이경희(2010)가 2000~2008년 보험개발원 자료를 이용해 추정한 월별, 년간 생명보험 상품군별 해지율이 있다. 추정 결과, 계약 유지기간이 상대적으로 긴 연금을 제외한 나머지 상품군의 해지율이 가입 후 6~9개월까지 급격히 상승하다가 이후 완만하게 감소하는 것으로 드러났다. 민영의료보험 해약률 연구로는 유창훈, 김정동(2011)과 김대환(2016)이 있는데 모두 의료패널자료를 이용하였다. 전자는 민영의료보험 가입 결정요인과 해약 결정요인을 동시에 다루었기 때문에 해약에 대해서는 개인별 특성에 대한 단변량 분석만을 제시하였다. 김대환 역시 2008~2013년 의료패널을 사용해 실손의료보험 해약을 분석했다. 병원 방문과 보험금, 장애, 만성질환 등을 대리변수로 하여 건강상태가 좋지 않을 경우 계약을 유지하는 경향이 있고 반대의 경우에는 해약을 하는 사후적 역선택을 발견하였다.\r\nThis study is an empirical analysis of the effect of policyholder and product characteristics of PHI on the lapse rate. The data used are PHI contract data and claim data, and the methodology is a generalized linear model. This paper attempted to focus on a close review of the policyholder characteristics and lapse rate of PHI, which have been limited to data constraints, and raising problems in the PHI market in the current situation.\r\nActual PHI can help identify lapse and policyholder characteristics, and this study has timeliness in the following points. First, as PHI enters the mature market, it seems more urgent to come up with measures to reduce existing policyholder’ departure from the system and prolong contract retention by identifying and improving institutional deficiencies in the PHI market at this point. Second, the analysis results of policyholder characteristics and policyholder movement show that it is necessary to reconsider the institutional stability of PHI. As a result of the analysis, the difference in lapse rate between policyholders with a history of claim and policyholders without a history of claim was remarkable. This phenomenon is called Adverse Retention, and Adverse Retention is the occurrence of Adverse Selection not only in the taking out stage but also in the lapse stage, and if repeated over a period of time, it can be a threat to the continuation of the system. Studies on lapse rate are classified according to explanatory variables. One is to analyze the relationship between macro variables such as interest rate, unemployment rate, and lapse rate, such as Kuo, Tsai, and Chen (2003), and they verified the emergency fund hypothesis and interest rate hypothesis. The other is to analyze the relationship between policyholder characteristics and lapse rate using individual contract data, and Li and Jensen (2012) analyzed the lapse rate of US Long-Term Care Insurance (LTCI) using HRS data from 2000-2008. Eling and Kiesenbauer (2013) analyzed the product types and policyholder characteristics that affect the lapse rate using life insurance contract data for the period 2000-2010. Christiansen, Elling, Schmidt, and Zirkelbach (2014) analyzed the effect of product types and policyholder characteristics on lapse rate using private medical insurance contract data from 2010. Previous domestic studies on the lapse rate include monthly and annual lapse rate estimated by Hwang Jin-tae and Lee Kyung-hee (2010) using data from the Korea Insurance Development Institute from 2000 to 2008. As a result of the estimation, it was found that the lapse rate of the rest of the product group rose sharply from six to nine months after taking out, except for pensions with a relatively long contract persistency period, and then gradually decreased. Research on the lapse rate of private medical insurance includes Yoo Chang-hoon, Kim Jung-dong (2011), and Kim Dae-hwan (2016), all of which used medical panel data. Since the former dealt with both the determinants of private medical insurance signing up and the determinants of lapse, only a univariate analysis of individual characteristics was presented for lapse. Kim Dae-hwan also analyzed the lapse of PHI using the 2008-2013 medical panel. Hospital visits, insurance benefit, disability, and chronic diseases were used as proxy variables, and the contract tended to be maintained when the health condition was poor, and in the opposite case, a post adverse selection was found.\r\n3. theoretical frameworks\r\nTable 1\r\n분석에 사용된 자료는 실제 실손의료보험의 계약자료와 청구자료이다. 설명변수의 자료집계기간은 2012년부터 2015년까지 4기간이며 종속변수인 해약은 2016년 보험료 납입실적을 기준으로 유지와 해약을 구분하였다. 설명 변수는 요율변수인 성별, 연령, 상해등급, 계약자 선택담보, 경과기간이다.\r\nThe data used for the analysis are actual contract data and claim data of PHI. The data aggregation period for explanatory variables is four periods from 2012 to 2015, and lapse, a dependent variable, was classified into persistency and lapse based on the 2016 premium payment performance. Explanatory variables are rate variables such as gender, age, level of injury, chosen coverage, and contract age.\r\nTable 2\r\n실손의료보험 가입자가 선택할 수 있는 최소담보단위는 상해외래(injury-outpatient), 상해입원(injury-inpatient), 질병외래(disease-outpatient), 질병입원(disease-inpatient)이다. 가입자는 네 가지 최소담보 중에서 선택할 수 있으며 선택한 담보수에 따라 계약자별 세부보장이 달라진다\r\nThe minimum coverage unit that PHI policyholder can choose are injury-outpatient, injury-inpatient, disease-outpatient, and disease-inpatient. Policyholders can choose from four minimum coverage, and detailed coverage for each contractor vary depending on the number of coverages selected.\r\nTable 3\r\n계약자 구성은 남성이 54.9%로 여성 45.1%보다 약 10% 많았고 직업군에 따라 분류되는 상해등급은 사무직인 1급이 61.5%, 2급과 3급이 38.5%이다.\r\nThe mix of policyholders was 54.9% for men, about 10% more than 45.1% for women, and 61.5% for first-class office workers and 38.5% for second-class and third-class workers.\r\nTable 4\r\n<Table 4>는 전체 가입자(policyholder), 가입자 중 보험금 비청구자 (non-claimant), 가입자 중 보험금 청구자(claimant) 세 그룹의 선택담보 별 가입비율이다.\r\n<Table 4> is the subscription ratio for each of the three groups of policyholders, non-claimants among policyholders, and claimants among policyholders.\r\nTable 5\r\n<Table 5>는 청구자 그룹과 비청구자 그룹의 계약유지 및 해약을 정리한 비율 분할표이다. 가로는 청구자/비청구자간 구성비율이고 세로는 계약유지/탈퇴간 구성비율이다.\r\n<Table 5> is a ratio division table that summarizes the retention and lapse of contracts between the claimant group and the non-claimer group. Horizontal is the composition ratio between the claimant and the non- claimant, and vertical is the composition ratio between retention and decrement of the contract.\r\nTable 6\r\n<Table 6>의 담보별 해약률은 청구자/비청구자의 선택담보별 탈퇴계약 비율이다.\r\nThe lapse rate by coverage in <Table 6> is the ratio of decrement contracts by chosen coverages of the claimant/non- claimant.\r\nTable 7\r\n<Table 7>은 빈도와 심도에 따른 담보별 속성을 보여준다. 비청구자 그룹의 해약률이 청구자 그룹의 해약률 보다 컸던 것처럼 청구자 내 유지계약의 빈도와 심도가 해지계약의 빈도와 심도 보다 크다.\r\n<Table 7> shows the properties of each coverage according to frequency and severity. Just as the lapse rate of the non- claimant group was greater than that of the claimant group, the frequency and severity of the retention contract within the claimant are greater than the frequency and depth of the decrement contract.\r\nTable 8\r\n<Table 8>은 현재 그룹별 해약률이 유지된다고 단순 가정했을 때 5기간 후 유지율이다. 다른 모든 조건이 동일하고 계약자 구성의 변화만 반영했을 때 보험료는 현재 수준대비 15.9%이 증가한다. 저위험군의 해약률이 고위험군의 해약률보다 큰 지금의 상태가 일정 기간 지속되는 것만으로도 계약자 구성은 변하고 보험료 인상 역시 불가피해진다.\r\n<Table 8> is the retention rate after 5 periods assuming that the current lapse rate for each group is maintained. When all other conditions are the same and only changes in the mix of policyholders are reflected, insurance premiums increase by 15.9% compared to the current level. As the current state, where the lapse rate of the low-risk group is greater than that of the high-risk group, continues for a certain period of time, the mix of policyholders changes and premium increase becomes inevitable.\r\nModel\r\n실증분석에 사용된 반응변수 y_i는 해약발생에 대한 지시변수로 0과 1의 값을 가지며 베르누이 분포를 따른다. 일반화선형모형은 반응변수의 기댓값 μ_i의 로짓 함수값 g(μ)=lna(μ/(1-μ))는 예측결과값 x’β를 [0,1]으로 변환해주므로 해약과 같이 0혹은 1의 값을 갖는 이진형 반응변수에 적합하다.\r\nThe response variable y_i used in the empirical analysis has values of 0 and 1 as indicators for the occurrence of lapse and follows the Bernoulli distribution. The generalized linear model is suitable for binary response variables with a value of 0 or 1 such as lapse because the logit function value g(μ)=lna(μ/(1-μ)) of expectation value μ_i of the response variable converts the predicted result value x’β into [0,1].\r\n4. Analysis\r\nTable 9\r\n요율변수 중 이탈도 감소는 상해등급 3,270, 성별 1,601, 연령 357 순이다. 상해등급은 양이 추정계수값을 가지며 등급이 올라갈수록 해약이 증가하는 것으로 나타났다. 앞서 살펴보았듯이 C[5]상해의 해약률은 비청구자, 청구자 그룹 모두 평균대비 높았고 빈도도 평균보다 낮았다.\r\nAmong the rate variables, the decrease in deviance is in the order of the level of injury 3,270, gender 1,601, and age 357. It was found that the level of injury had a positive estimation coefficient, and the higher the level, the higher the lapse. As discussed earlier, the lapse rate of C[5] injury was higher than the average for both non- claimant and claimant groups, and the frequency was lower than the average.\r\nTable 10\r\n성별의 경우 남성보다는 여성이 해약을 덜 하는 것으로 나타났다. 여성의 오즈값은 e^0.9로 30대 남녀의 해약률 차이는 0.8%이고 60대 남녀의 해약률 차이는 0.6%이다.\r\nIn the case of gender, women were found to have less lapse than men. The odds value of a woman is e^0.9. The difference in lapse rate between men and women in their 30s is 0.8%, and the difference in lapse rate between men and women in their 60s is 0.6%.\r\nTable 11\r\n경과년수 추가로 인한 이탈도 감소는 89,031로 설명변수 중 가장 높았다. 오즈값은 0.3으로 보유기간이 늘어남에 따라 해약률이 감소하는 것으로 나타났다. 이는 일반적으로 해약률은 초년도 해약률이 가장 높고 시간이 지남에 따라 감소하는 경향과 일치한다. <Figure 2>는 경과년수별 실제 해약률로 2년도 해약률이 13.8%로 가장 높다.\r\nThe decrease in deviance due to the addition of the coverage age was 89,031, the highest among explanatory variables. The odds value was 0.3, indicating that the lapse rate decreased as the retention period increased. This is generally consistent with the tendency of the lapse rate to be the highest in the initial year and to decrease over time. <Figure 2> is the actual lapse rate by the coverage age, and the two-year lapse rate is the highest at 13.8%.\r\nTable 12\r\n청구실적 변수(비청구자/청구자)의 오즈값은 0.3으로 청구실적이 있을 경우 비청구자에 비해 해약을 덜 하는 것으로 나타났다. 해약률은 기본집단(남자, 30대, 상해1급) 기준으로 비청구자 10.3%, 청구자 3.3%로 추정되었다. 성별차이가 가장 적은 연령대는 60대 0.2%로 다른 연령대의 성별차이 0.3%보다 낮았다.\r\nThe odds value of the claim performance variable (non-claimant/ claimant) was 0.3, indicating that if there was a claim history, the lapse was less than that of the non-claimant. The lapse rate was estimated to be 10.3% for non-claimants and 3.3% for claimants based on the basic group (men, 30s, first-class injury). The age group with the smallest gender difference was 0.2% in their 60s, lower than the gender difference of 0.3% in other age groups.\r\nFigure 4\r\n<Figure 4>은 비청구자 그룹을 좀 더 세분해서 살펴보고자 분석자료의 무청구년수별 해약률을 나타낸 것이다. 경과기간 4년인 계약은 전체 계약의 19.2%로 경과기간 4년 계약만을 대상으로 집계한 해약률이다.\r\n<Figure 4> shows the lapse rate by number of non-claimed years of analysis data in order to further subdivide the non-claimant group. Contracts with a four-year coverage age are 19.2% of the total contracts, which are the lapse rate for contracts with only four-year coverage age.\r\nTable 14\r\n세부담보 모형의 기준수준은 C[15]전체 담보이다. 설명변수 추가로 인한 이탈도 감소는 8,465로 다른 설명변수에 비해 가장 적었다. 담보변수 중 일부에 대해서는 유의하지 않은 결과가 나타났다. 이는 C[15]전부선택, C[5]상해, C[6]외래, C[9]입원, C[10]질병 이외에 담보를 선택한 가입자 비율이 2%로 자료의 수가 작기 때문인 것으로 보인다. 또한 유의한 결과가 나온 일부 담보 역시 기준수준에 비해 해약률 상대도가 지나치게 높게 나타나 담보에 따라 해약 정도를 단순비교하기에는 어려워 보였다.\r\nThe reference level of the detailed coverage model is C[15] total coverage. The decrease in diviance due to the addition of explanatory variables was 8,465, the lowest compared to other explanatory variables. There were insignificant results for some of the coverage variables. This seems to be due to the small number of data, with 2% of policyholders choosing coverage without all C[15] choices, C[5] injuries, C[6] outpatient, C[9] inpatient, and C[10] disease. In addition, some coverage with significant results also showed too high relative lapse rate compared to the standard level, making it difficult to simply compare the degree of lapse depending on the coverage.\r\nTable 15\r\nC[6]외래와 C[10]질병의 오즈값은 0.55, 0.89로 기본수준인 C[15]전체 담보에 비해 낮았고, C[5]상해와 C[9]입원의 오즈값은 1.80, 1.61로 전체 담보에 높았다. 상해와 입원은 질병과 외래에 비해 상대적으로 빈도는 낮고 심도가 높은 편으로 심도가 클수록 해약률이 높다고 할 수 있다.\r\nThe odds values of C[6] outpatient and C[10] diseases were 0.55, 0.89, which was lower than the basic C[15] total coverage, and the odds values of C[5] injury and C[9] inpatient were 1.80 and 1.61, which were high for the total coverage. Injury and inpatients are relatively less frequent and higher in severity than diseases and outpatients, and the higher the severity, the higher the lapse rate.\r\nTable 16\r\n<Table 16>은 각 분석모형의 적합성 평가지표와 적합성 검정의 결과이다. 요율변수(성별, 나이, 상해등급)과 선택담보, 청구이력 여부, 경과기간 중 가 장 많은 이탈도 감소를 보인 설명변수는 경과년수이다. 또한 요율변수와 두 변수 조합 중 가장 큰 이탈도 감소를 보인 것은 선택담보와 경과년수이다.\r\n<Table 16> is the suitability evaluation index and the result of suitability test of each analysis model. Among the explanatory variables such as rate variables (gender, age, level of injury), chosen coverage, claim history, and coverage age, the variable that showed the most decrease in deviance is the coverage age. In addition, the largest decrease in the deviance between the combination of the rate variables and the two variables was chosen coverage and coverage age.\r\nTable 17\r\n교호항에 대해서 가장 설명력이 높은 경과기간을 중심으로 검토한 결과 경과기간과 이탈도감소의 경우와 마찬가지로 경과기간과 선택담보 교호항의 설명력이 가장 높은 것으로 나타났다. 다른 변수들에 대해서 교호항을 적용한 결과는 원래 모형과의 차이가 크지 않았다.\r\nAs a result of reviewing the interaction term focusing on the most explanatory coverage age, the explanatory power of the coverage age and the interaction term for chosen coverage was found to be the highest as in the case of coverage age and a decrease of deviance. As a result of applying the interaction term to other variables, the difference from the original model was not significant.\r\nTable 18\r\n모든 설명변수 모형에서도 여성, 연령 증가, 청구자, 경과년수 증가, 낮은 상해등급일수록 해약률이 낮아 개별모형과 일관된 결과를 나타냈다. 다만 담보별 해약의 경우 선택담보 모형에서는 상해와 입원이 전체담보보다 해약이 낮았다. 모든 변수를 포함한 모형에서는 상해, 입원, 질병, 외래 모두 전체담보 대비 해약률이 높아 개별모형의 결과가 더 신뢰성이 높다고 생각한다.\r\nIn all explanatory variable models, women, age increase, claimant, coverage age, and lower level of injury showed lower lapse rate, consistent results with individual models. However, in the case of lapse by coverage, injuries and inpatient were lower than the total coverage in the chosen coverage model. In the model including all variables, injury, inpatient, disease, and outpatient all have a high lapse rate compared to the total coverage, so we think the results of the individual model are more reliable.\r\n5. Results\r\n이 연구는 실제 실손의료보험 계약자료와 청구자료를 이용한 실증분석을 통해 실손의료보험의 계약자 특성과 선택담보별 특성이 해약률에 미치는 영향을 다루었다. 분석을 통해 검토한 실손의료보험의 특징들은 다음과 같다. 첫째, 계약자별⋅상품별 특성이 해약률에 미치는 영향을 확인하였다. 성 별, 연령, 상해등급, 경과년수, 보험금 청구실적, 선택담보가 설명변수로 사 용되었으며 현재 요율변수와 각각의 설명변수에 대한 추정식에서 모두 통계 적으로 유의미한 결과를 나타내었다. 둘째, 계약자별⋅상품별 특성에 대한 개괄적 사항의 기술과 요약을 포함하였다. 자료의 제약성 등으로 제한적으로 검토되었던 사항들에 대해 분석 취지를 넘어서지 않는 한도 내에서 가급적 많은 정보를 전달하고자 하였다. 특히 세분화된 선택담보별 정보는 실손의료보험의 위험특성에 대한 이해도 제고에 유용할 것이다. 셋째, 역유지(adverse retention) 현상을 확인하고 야기될 수 있는 문제점을 검토하였다. 청구자와 비청구자 그룹간 해약률 차이는 실손의료보험의 역유지를 강하게 시사하며 현 상태가 지속되는 것만으로 불리한 계약자 구 성이 야기될 수 있다는 점을 환기해주었다. 무엇보다 무청구년수가 증가할 수록 해약률이 증가한 점은 저위험 고객군의 제도이탈 방지 방안의 정립 필 요성을 강하게 뒷받침하였다. 현재 실손의료보험은 2017년 이후 신규 가입자에 대해서 무청구 시 보험 료의 일부를 할인하도록 하고 있다. 이는 저위험군 가입자의 유인 제공의 필 요성에 대해서 감독당국도 숙지하고 있다는 뜻으로 해석된다. 하지만 이는 계약자간 위험정도를 청구자와 비청구자로 구분한 것으로 아주 제한적인 계 약자실적의 반영이다. 실제 계약자간 위험수준별 분포와는 상당한 차이가 있으며 청구자 집단 내의 잔여 위험특성 편차 역시 매우 크다22). 세분화되 지 못한 위험집단의 구분은 위험평가의 정교함을 개선하는데 제한적일 수밖에 없다. 만일 할인할증제도처럼 계약자실적 정보를 좀 더 포괄적으로 반영할 수 있다면 보다 정교한 위험수준별 보험료 부과가 가능할 수 있다. 끝으로 분석에 사용된 자료는 실손의료보험이 특약으로 가입이 가능하였 던 시기의 자료이므로 주계약의 특성에 따라 해약이 발생할 여지가 존재할 수 있으므로 차후에 실손의료보험이 단독상품으로 팔린 자료에 대한 추후 연구가 필요하다.\r\nThis study dealt with the effect of policyholder and coverage characteristics of PHI on the lapse rate through empirical analysis using actual PHI contract data and claim data. The characteristics of PHI reviewed through analysis are as follows. First, the effect of the characteristics of each policyholder and product on the lapse rate was confirmed. Gender, age, level of injury, claimant and contract age, and coverage were used as explanatory variables, and statistically significant results were shown in both the current rate variables and the estimation equation for each explanatory variable. Second, it included a summary and description of general information on the characteristics of each policyholder and product. We tried to deliver as much information as possible to the extent that it did not exceed the purpose of analysis on matters that had been limitedly reviewed due to data constraints. In particular, the detailed information by coverage will be useful in enhancing the understanding of the risk characteristics of PHI. Third, we identified the inverse retention phenomenon and reviewed problems that may be caused by this. The difference in lapse rate between the claimant and non-claimer groups strongly suggested the adverse retention of PHI and recalled that the continued current status could lead to unfavorable policyholder mix. Above all, the fact that the lapse rate increased as the number of non-claimed years increased strongly supported the need to establish a plan to prevent the departure of low-risk policyholder. Currently, PHI has allowed new policyholder to be discounted part of their insurance premiums if they do not claim since 2017. This is interpreted as meaning that regulators are well-acquainted with the need to provide incentives for low-risk policyholders. However, this is a reflection of very limited policyholder claim, as the level of risk between policyholders is divided into claimant and non-claimant. There is a significant difference from the distribution by risk level among actual policyholders, and the deviation in residual risk characteristics within the claimant group is also very large. The classification of unsegmented risk groups is bound to be limited in improving the sophistication of risk assessment. If policyholder claim information can be more comprehensively reflected, such as the Bonus-Malus system, more sophisticated premium charging by risk level may be possible. Finally, the data used for the analysis are data from the time when PHI was available as a special contract, so there may be room for lapse depending on the characteristics of the main contract, so further research is needed on the data sold as a single product in the future.\r\n6. Refernce\r\nKim, Daehwan, “Empirical Analysis of Maintaining and Canceling Behaviors of the Indemnity Private Health Insurance and Its Implications,” Korean Journal of Insurance 108 (2016): 29-54.\r\nYou, Changhoon and Kim, Jeongdong, “A Study on the Determinants of Purchasing and Surrendering Private Health Insurance,” Journal of Risk Management 22(2) (2011): 189-222.\r\nLee, Kyoungah and Lee, Hangsuck, “Adverse Selection and Rates Differentiation in the Korean Private Health Insurance,” Journal of Risk Management 27(3) (2016): 93-128.\r\nLee, Hangsuck, Lee, Gaeun and Lee, Kyoungah, “A Ratemaking of the Korean Private Health Insurance using GLM,” Journal of Risk Management 28(7) (2017): 37-71.\r\nLee, Hangsuck, Lee, Minha and Baek, Hye-Yeon, “An Empirical Analysis of Bonus-Malus System in the Private Health Insurance,” Korean Journal of Insurance 111 (2017): 41-73.\r\nLee, Hangsuck, Lee, Su-Bin and Baek, Hye-Yeon, “Rate Differentiation in the Korea Private Health Insurance,” Korean Journal of Insurance 111 (2017): 41-73.\r\nHwang, Jintae and Lee, Kyounghee, “Estimating and Forecasting Models of Lapse Rates in the Life Insurance Industry,” KiRi Research Report (2010)\r\nAltman, Daniel, David M. Cutler, and Richard J Zeckhauser, “Adverse Selection and Adverse Retention,” American Economic Review 88(2) (1998): 122-126.\r\nChristiansen, Marcus, Martin Eling, Jan-Philipp Schmidt and Lorenz Zirkelbach, “Who is Chaing Health\r\nInsurance CoverageEmpirical Evidence on Policyholder Dynamics,” The Journal of Risk and Insurance 83(2) (2014).\r\nEling, Martin and Dieter Kiesenbauer, “What Policy Features Determine Life Insurance Lapse? An Analysis of the German Market,” The Journal of Risk and Insurance 81 (2013): 241-269.\r\nFaraway, J. Julian, Extending the Linear Model with R, CRC Press, 2016.\r\nJong, De Piet and Gillian Z. Heller, Generalized Linear Models for Insurance Data, Cambridge, 2008.\r\nKuo, Weiyu, Chenghsien Tsai and Wei-Kuang Chen, “An Empirical Study on the Laps Rate: The Cointegration Approach,” The Journal of Risk and Insurance 70 (2003): 489-508.\r\nLi, Yong and Gail A. Jensen, “Why Do People Let Their Long-term Care Insurance Lapse? Evidence from the Health and Retirement Study,” Applied Economic Perspectives and Policy 37(2) (2012): 220-237.\r\nFinancial Supervisory Service (http://www.fss.or.kr)\r\nGENERAL INSURANCE ASSOCIATION OF KOREA (https://kpub.knia.or.kr)\r\nStatistics Korea (http://kostat.go.kr)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-26T16:28:51+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-09-11-실손의료보험에서 다중 담보를 반영한 경험적 보험료 산정 번역/",
    "title": "실손의료보험에서 다중 담보를 반영한 경험적 보험료 산정 번역",
    "description": "번역 완료 제출",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-09-11",
    "categories": [],
    "contents": "\r\n1. 초록\r\n실손의료보험에서 경험적 보험료 산정에 대한 기존 연구는 개별 담보별 분석을 통한 보험료 차등화 방식을 주로 다루었다. 실손의료보험은 상해와 질병에 대하여 통원과 입원 등의 다중 담보를 보장하는 보험상품으로 현재는 계약자별 위험특성을 충분히 반영하지 못하는 단일 보험료 부과 방식이 적용되고 있다. 그러나 이러한 요율산정방식으로 인해 역선택, 도덕적 해이 등의 문제점들이 발생함에 따라 개선된 요율산정 방식에 대한 관심이 점점 늘고 있다. 이러한 개선 의지에 따라 이 연구에서는 과거 계약자의 경험정보를 바탕으로 계약자의 리스크 성향을 반영하는 베이지언 접근법을 근거로 한 경험적 요율산정 방식을 제안하 고자 한다. 또한 개별 담보별로 각각 모형화하여 경험적 보험료를 산출했던 선행연구를 발전시켜 다중 담보(multiple coverages)를 동시에 반영하는 경험적 요율산정 방법에 대하여 논의하고자 한다. 이 연구에서는 담보별로 사고 빈도의 모형을 복합적으로 반영하기 위해 담보와 사전 요율변수와의 교호작용을 추가한 일반화 혼합선형모형을 사용하였다. 그리고 실증분석을 위해 보험사 데이터를 이용하여 정상적인(stationary) 상태에 도달했을 때의 계약자 포트폴리오 와 최적 상대도(베이지언 보험료)를 산출하여 경험적 요율산정 방식을 제시하였다. 이러한 요율산정 방식은 단일 보험료 부과 방식에 비해 보험사의 리스크 관리 및 피보험자들 간 형평성을 제고하는데 도움을 줄 것으로 예상된다.\r\nThe existing studies on the experience rate making in private health insurance has mainly dealt with the way of premium differentiating from the analysis of individual coverage. In the case of private health insurance, the insurance system guarantees multiple coverage such as outpatient and inpatient for injuries and diseases. Currently, a single premium that does not fully reflect the risk characteristics of each policyholder is applied. However, because of the problems such as adverse selection and moral hazard due to such rate making, there is an increasing interest in the improved rate making. In this study, we propose an experience rate making based on the Bayesian premium approach which reflects the risk characteristics of the policyholder based on experience information about the policyholder from the past. In addition, we will discuss the experience rate making that simultaneously reflects multiple coverage by developing prior studies that model experience rate making for each individual coverage. In this study, we used a generalized liner mixed model with the interaction of coverage and pre-rate variables to reflect the complexity of the frequency by coverage. For the empirical analysis, the experience rate making is proposed by calculating the policyholder’s portfolio when the stationary state is reached and the optimal degree of relativities (Bayesian premium) using the insurance data. This rate making is expected to help insurers manage risk and improve equity among policyholders compared to single premiums.\r\n2. purpose of the study\r\n매년 실손의료보험의 손해율(발생손해액/경과보험료)은 감소하는 추세를 보이고 있으나, 실손의료보험이 꾸준하게 성장함에 따라 여전히 손해율이 높은 편이기 때문에 실손의료보험의 개선 방안 관련 논의들이 활발하게 이뤄질 필요가 있다. 그러나 실손의료보험에서 질병과 상해, 통원과 입원 등 다양한 담보들을 보장하고 있는 것에 반해 기존의 연구들은 담보별 분석 또는 단일 담보 위주로 보험료 차등화 방식이 논의되어 왔다. 일반적으로 실손의료보험은 가입자들이 하나 이상의 담보를 보장받기 때문에 다중 담보를 포괄한 보험료율 산정 방식에 대한 논의가 반영될 필요가 있다. 이러한 맥락에서 본 연구는 실손의료보험의 사전 요율변수 및 과거 보험사고 이력을 고려한 경험적 요율산정 방식을 적용한 실증분석에 관한 연구이며 기존의 단일 담보를 고려했던 연구에서 더 나아가 다중 담보를 하나의 모델에서 함께 고려해본 연구이다. 선행연구는 크게 두가지 갈래로 나누어 볼 수 있다. 먼저, 실손의료보험의 지속적인 성장과 함께 보험사의 손해율 또한 꾸준히 상승하면서 이에 대한 연구가 많이 이루어졌다. 특히 역선택 및 도덕적 해이가 실손의료보험의 손해율 상승에 미치는 영향과 경험적 요율산정 도입에 대한 연구들이 이루어 졌다. 김대환, 이봉주(2013)는 실손의료보험에서 역선택 및 도덕적 해이를 확인하고자 한국의료패널 데이터를 이용하여 건강리스크가 높은 사람들이 실손의료보험에 가입할 가능성이 현저하게 증가하는 역선택이 존재함을 증명하였다. 김대환(2016)의 후속 연구에서는 실손의료보험의 유지 및 해약에 대한 선택권이 전적으로 계약자에게 달려있을 경우 가입시점에 역선택뿐만 아니라 사후적인 역선택 역시 존재하고 있음을 발견하였다. 두번째로 실손의료보험의 보험료 차등화 및 경험적 요율산정에 대한 연구들이 이루어졌다. 정성희, 이정택(2016)은 국내 실손의료보험에서 일부 가입자의 의료이용 집중이 모든 가입자의 보험료 부담으로 전가되는 문제점을 지적하며 형평성 문제에 대한 대안으로 보험사고 및 보험금 청구 실적에 따른 갱신 보험료 차등화 방안의 검토 필요성을 제기하였다. 이항석, 이가은, 이경아(2017)는 실손의료보험의 현행 요율변수인 성별, 연령, 상해급수(위험급수)에 계약자의 과거 실적변수를 요율산정 시 추가 도입하는 것을 제안하였다. 일반화 선형 모형(GLM)을 이용하여 과거실적 변수가 현행 요율변수보다 더 높은 설명력을 가진다는 것을 확인하였다. 조재린, 정성희(2018)는 역선택과 도덕적 해이, 갱신보험료의 과도한 상승으로 인해 현행 실손의료보험의 지속가능성 저하 문제를 제기하였다. Oh, Shi, Ahn(2019)은 보험청구 자료를 이용하여 할인할증제도에 청구 건의 빈도와 심도 간의 종속성을 반영할 수 있는 모델에 대해서 제안하고, 실증분석을 진행하였다. 마지막으로 이항석, 백혜연, 이민하(2018)는 개별 담보에 대해 과거 경험 데이터를 사용하여 계약자 등급별 장기 포트폴리오 및 최적 상대도를 산출하였다. 이 때 담보마다 개별적인 모형을 생성하여 분석하므로 계약자의 과거 보험사고 이력을 바탕으로 경험적 요율산정 방식을 소개하였다.\r\nAlthough the loss rate (Incurred Losses/ Earned premium) of PHI is on the decline every year, discussions on ways to improve PHI need to be actively conducted as it continues to grow. However, while PHI covers various coverage such as outpatient and inpatient for injuries and diseases, previous studies have discussed the rates differentiation methods through analysis by coverage or focusing on single coverage. In general, since policyholders are guaranteed one or more coverages in PHI, discussions on how to calculate insurance premiums covering multiple coverages need to be reflected. In this context, this study is an empirical analysis that applies the experience rate making to consider the pre-rate variables and experience information about the policyholder from the past, and further considers multiple coverages in one model. Prior studies can be divided into two main branches. First, along with the continuous growth of PHI, the loss ratio of insurance companies has also steadily increased, and many studies have been conducted on this. In particular, studies about the effect of adverse selection and moral hazard on the increase in the loss rate of PHI and the introduction of empirical rate making have been conducted. Kim Dae-hwan and Lee Bong-ju (2013) proved that there are adverse selection in which people with high health risks are significantly more likely to be policyholders in PHI using the Korean Medical Panel data. In a follow-up study by Kim Dae-hwan (2016), it was found that if the option for maintenance and cancellation of PHI is entirely up to the policyholder, not only adverse selection at the time of purchase but also posterior adverse selection exists. Second, studies were conducted on the rates differentiation method and empirical rate making of PHI. Jung Sung-hee and Lee Jung-taek (2016) raised the need to consider ways to differentiate renewal premiums according to history of insurance accidents and insurance claims, pointing out the problem that the concentration of medical use of some policyholders in domestic private health insurance is passed on to the burden of insurance premiums for all policyholders. Lee Hang-seok, Lee Ga-eun, and Lee Kyung-ah (2017) proposed to additionally introduce policyholder’s past experience variables to the current rate variables of PHI such as gender, age, and injury (risk series). Using the generalized linear model (GLM), it was confirmed that the past experience variable had higher explanatory power than the current rate variables. Cho Jae-rin and Jung Sung-hee (2018) raised the issue of reducing the sustainability of the current PHI due to adverse selection, moral hazard, and excessive increase in renewal premiums. Oh, Shi, and Ahn (2019) proposed a model that could reflect the dependence between the frequency and severity of claims in the Bonus-Malus systems using insurance claim data and conducted an empirical analysis. Finally, Lee Hang-seok, Baek Hye-yeon, and Lee Min-ha (2018) calculated the long-term portfolio and optimal relativity by policyholder grade using past experience data for individual coverage. At this time, an individual model was created and analyzed for each coverage, so the empirical rate making method was introduced based on the policyholder’s past experience history.\r\n3. theoretical frameworks:\r\n본 연구에서 사용한 모형은 일반화 혼합선형모형(Generalized Linear Mixed Model, GLMM)으로 GLM의 확장된 모형들 중 하나이다. 일반화 혼합선형모형(이하 GLMM)에서는 GLM에서 설명변수의 계수들을 모두 고정 효과(fixed effect)로 보고 있는 것에 반해 임의 효과(random effect)를 고려하고 있다. 다음의 식은 GLMM을 나타낸 것이다.\r\n\\(g(μ)=ln(μ)= x'\\beta+ z'\\gamma ,\\gamma \\sim {\\sf N}(0, G)\\)\r\n위의 식에서 X_1= x_1,… ,X_p= x_p들은 피보험자의 특성을 나타내는 개인의 사전적 관찰 정보들인 설명변수들로 생각할 수 있고, 이들의 계수는 군집(보험증권들 또는 피보험자들)에 따라 다른 값이 아닌 고정 효과로 간주하게 된다. 또한 설명변수 z의 계수인 모수 벡터 γ는 공분산 행렬 G를 갖는다고 가정하고, 본 연구는 GLMM을 이용하여 계약자의 사전적 관찰 정보들(설명변수 x_i들)과 비관찰 정보들(설명변수 z)을 모두 활용하여 실손의료보험에서 다중 담보를 반영한 보험료율 산정 방식에 대해 논의한다. 독립 변수 간의 상호 작용이 종속 변수에 영향을 주는 교호작용을 고려하여 y를 보험사고 청구 건수로 가정할 때 교호작용을 고려하여\r\ny~성+연령+위험급수+담보+성:담보+연령:담보+위험급수:담보\r\n로 식을 설정하였다.\r\nThe model used in this study is a generalized linear mixed model (GLMM), which is one of the extended models of GLM. The generalized mixed linear model (referred to as GLMM) considers random effects while all the coefficients of explanatory variables in GLM are viewed as fixed effects. The following equation represents GLMM.\r\n\\(g(μ)=ln(μ)= x'\\beta+ z'\\gamma ,\\gamma \\sim {\\sf N}(0, G)\\)\r\nIn the above equation, X_1= x_1,… ,X_p= x_p can be considered as explanatory variables, which are individual prior observation information representing the characteristics of the insured, and their coefficients are considered fixed effects, not different values, depending on the cluster (insurance policies or insured). In addition, assuming that the parameter vector γ, the coefficient of the explanatory variable z, has a covariance matrix G, this study discusses the method of rate making reflecting multiple coverage in PHI using both the policyholder’s prior observation information (explanatory variable x_i) and non-observation information (explanatory variable z) through GLMM. In consideration of the interaction effect in which the interaction between independent variables affects the dependent variable, we assume y as the number of insurance claims considering the interaction effect. The equation was set as\r\ny~gender + age + risk level + coverage + gender:coverage + age:coverage + risk level:coverage.\r\n계약자의 등급 간 이동은 마코프 체인(Markov chain)으로 나타낼 수 있다. 경험적 요율산정 방법 하에서 당해 연도의 보험료는 과거 전체의 실적이 아닌 직전연도의 보험금 청구 건수에 따라 결정되기도 하는데 이때 마코프 체인을 사용하게 된다. 계약자의 등급 간 전이 과정이 장기간 지속될 경우 각 등급별 계약자의 분포는 결국 안정적(정상상태, steady state)으로 구성된다.\r\nThe movement between the policyholder’s grades can be expressed as a Markov chain. Under the empirical rate making method, insurance premiums for the current year may be determined based on the number of insurance claims for the previous year, not the entire past performance, and Markov chain is used at this time. If the transfer process between the policyholder’s grades persists for a long time, the distribution of policyholders for each grade eventually consists of a stable (normal state).\r\n경험적 요율산정의 효율성이라는 것은 예측력에 대한 정확도로 표현할 수 있는데, 이것은 다시 정리해보면 실제로 피보험자가 납입했던 보험료와 해당 피보험자에 대한 실제 기대손실의 차이가 거의 나지 않도록 하여 예측력에 대한 정확도를 높인다는 것을 의미한다. 따라서 최적 상대도 r는 실적변수에 의한 실제 상대도 보험료와 사전 요율변수에 의한 상대도 보험료의 평균 제곱 오차(MSE)를 최소화함으로서 구할 수 있다.\r\nThe efficiency of the empirical rate making can be expressed as the accuracy of the predictive power, which means that there is little difference between the insurance premium actually paid by the insured and the actual expected loss for the insured. Therefore, the optimal relativity r can be obtained by minimizing the mean square error (MSE) of the actual relativity premium by past experience variable and the relativity premium by the pre-rate variable.\r\n4. analysis\r\n분석에 사용한 국내 보험사의 실손의료보험 가입 및 보상 데이터 중 질병 통원과 질병입원을 모두 보장받는 피보험자를 분석 대상으로 설정하였다. <Table 2>는 피보험자들을 사전 요율변수(성, 위험급수, 연령대)별로 나누어 계약자 분포와 담보(질병통원, 질병입원)별 평균 빈도 등과 같은 기초 통계 결과를 정리하였다.\r\nAmong the PHI data of domestic insurance companies used for the analysis, insured people who are guaranteed out both outpatient and inpatient of disease were set as targets for analysis. <Table 2> summarizes basic statistical results such as policyholder distribution by dividing the insured by pre-rate variable (gender, risk class, age group) and average frequency by coverage (disease outpatient, disease inpatient).\r\n<Table 3>은 실적 데이터를 활용하여 피보험자들의 과거 보험사고 이력이 포아송 분포를 따른다고 가정하여 GLMM 분석을 한 결과이다. <Table 3>을 보면 피보험자의 비관찰 정보에 대한 위험은 \\(\\theta \\sim {\\sf LN}(0, 1.223^2)\\)을 따르는 것을 알 수 있다.\r\n<Table 3> is the result of GLMM analysis assuming that the insured’s past insurance accident history follows the Poisson distribution using data. Looking at <Table 3>, it can be seen that the risk of non-observation information of the insured follows \\(\\theta \\sim {\\sf LN}(0, 1.223^2)\\).\r\nGLMM의 결과를 살펴보면, 성별의 효과의 방향(-)은 질병통원과 질병입원 모두 동일하지만, 평균 빈도의 상대도에서는 차이가 발생하고 있다. 즉, 다른 변수 값이 동일할 때 여성의 평균 빈도는 질병통원의 경우 남성에 비해 약 2배(1.97배), 질병입원의 경우 남성에 비해 약 1.4배(1.43배) 높을 가능성이 있다. 질병통원의 경우 위험급수 1급이 가장 발생가능성이 높게 나타났으나 질병입원의 경우에는 위험급수 1급이 가장 발생가능성이 낮은 것으로 나타났다.\r\nLooking at the results of GLMM, the direction (-) of the effect of gender is the same for both disease outpatient and disease inpatient, but there is a difference in the relativity of the average frequency. In other words, when other variable values are the same, the average frequency of women is likely to be about twice (1.97 times) higher than that of men in case of disease outpatient and about 1.4 times (1.43 times) higher than that of men in case of disease inpatient. In the case of disease outpatient, the risk grade 1 was the most likely to occur, but in the case of disease inpatient, the risk grade 1 was the least likely to occur.\r\n위험집단별로 정상상태에 도달했을 때 극한 분포인 계약자 포트폴리오를 제시하였다. 동일한 위험집단 내에서 이러한 계약자 분포(계약자 포트폴리오)를 가중치로 하여 상대도들의 기댓값을 산출한 결과가 Table 6의 가장 마지막 열인 E(r)이다.\r\nA portfolio of policyholders that becomes an extreme distribution when normal states are reached for each risk group was presented. The result of calculating the expected values of the relativity by using this policyholder distribution (policyholder portfolio) as a weight within the same risk group is E(r), the last column of <Table 6>.\r\n<Table 7>은 전체 피보험자를 성별로 나누어 비교한 것으로 남성이 여성에 비해 상대도가 더 높은 것으로 나타났다. 남성의 경우 기본 보험료에 최대 3.48배를 보험료로 납입해야 하며, 여성은 2.66배를 납입하게 된다. 남성의 경우 최고 등급과 최저 등급 간 상대도 차이가 3.10이나, 여성의 경우에는 2.39로 그 격차가 더 적은 것으로 나타났다.\r\n<Table 7> compared the total insured by gender, and it was found that men had a higher relativity than women. Men must pay up to 3.48 times the basic premium, and women will pay 2.66 times. In the case of men, the difference in relativity between the highest and lowest grades was 3.10, but in the case of women, the difference was 2.39, indicating that the gap was smaller.\r\n<Table 8>은 직업의 위험 노출 정도인 위험급수에 따라 그룹을 나눌 경우의 결과를 비교한 것이다. 동일 등급 내에서는 위험급수가 높아질수록 상대도의 크기가 점점 더 커지는 경향을 보이며, 특히 보험사고(청구) 빈도가 적은 등급(6등급)일 때 보다 보험사고(청구) 빈도가 높은 등급(1등급)으로 갈수록 위험급수별 상대도의 격차가 커지는 것으로 나타났다.\r\n<Table 8> is a comparison of the results of dividing the group according to the risk level, which is the degree of occupational risk exposure. Within the same grade, the size of the relativity tends to increase as the risk class increases, in particular, it was found that the gap in the relativity of each risk class increased as the grade (1) with low frequency of insurance accidents (claims) increased compared to the grade (6) with high frequency of insurance accidents (claims).\r\n<Table 9>는 연령대에 따른 상대도 분석 결과이다. 연령대가 증가할수록 상대도는 낮아지는 경향이 있다. 그러나 이러한 표를 해석할 때 주의해야 할 사항은 위험집단이 다를 경우 상대도의 절대 값을 바로 비교해서는 안 된다는 점이다. 기본 보험료라는 것 자체가 위험집단별로 차이가 있기 때문에 동일 위험집단 내의 상대도들만 절대 값의 대소 관계를 의미 있게 해석할 수 있음을 주의할 필요가 있다.\r\n<Table 9> is the result of analysis of relativity according to age group. As the age group increases, the relativity tends to decrease. However, one thing to note when interpreting these tables is that if the risk group is different, the absolute value of the relativity should not be compared immediately. Since basic insurance premiums themselves differ by risk group, it is important to note that only relativity within the same risk group can meaningfully interpret the size relationship of absolute values.\r\n<Table 10>은 모든 피보험자에게 적용할 수 있는 하나의 상대도를 구한 결과이다. 만약에 전체 피보험자에게 동일한 기본 보험료를 적용한다고 가정한다면, 상대도를 기준으로 1~3등급이 보험료 할증 그룹(상대도 1 이상), 4~6등급이 보험료 할인 그룹(상대도 1 미만)으로 볼 수 있다. 가장 고위험 등급인 1등급의 상대도를 기준으로 보면 상대도의 격차가 적게는 47%(=1.00-0.53)에서 최대89%(=1.00-0.11) 차이가 나는 것으로 나타났다.\r\n<Table 10> is the result of obtaining one relativity applicable to all insured people. Assuming that the same basic premium is applied to all insured people, grades 1 to 3 can be viewed as premium surcharge groups (relativity 1 or higher) and grades 4 to 6 as premium discount groups (relativity less than 1). Based on the relativity of grade 1, which is the most high-risk grade, there was a difference of up to 89% (=1.00-0.11) from 47% (=1.00-0.53) with a small gap in relativity.\r\n5. results:\r\n국내에서는 2017년 4월부터 신실손의료보험상품을 판매하여 2년간 보험금 미수령시 차년도 보험료의 10%를 할인받을 수 있게 되었다. 이와 같이 실손의료보험 가입자가 증가함에 따라 자동차보험과 같이 할인할증제도 적용 등에 대한 관심과 요구도 함께 증가하고 있다. 해외 국가의 보험사들을 참고해보면 실손의료보험의 보험료 산정 방식에 있어 계약자들의 위험 특성을 고려하는 방식 들이 주로 논의되고 있다. 그러나 특히 민영의료보험의 경우 보험료 차등화 방법 적용 시 적용 대상과 적용 방법에 대한 선정은 매우 신중을 기할 필요가 있다. 본 연구는 실손의료보험에서 계약자의 과거 보험사고 이력을 고려한 경험적 요율산정 방식 하에서 개별 담보별 모형들을 사용하기보다 다중 담보들을 통합 적으로 한 모형 안에서 고려하여 피보험자들에게 공정한 보험료를 산정하는 방법을 제안하는데 의의를 두고 있다. 현행 실손의료보험 보험료 산출 체계에서는 계약자별 리스크 특성의 차이를 충분히 반영하고 있지 못하기 때문에 보험사의 리스크 관리에 어려움이 많고 보험료 책정에 대한 형평성 논란이 꾸준히 제시되고 있는 실정이다. 따라서 계약자별로 각자 위험 수준에 상응하는 보험료를 산 출하는 방법에 대한 연구가 필요한 것이다. 본 연구에서는 그러한 연구의 필요 성을 시작으로 계약자의 비관찰 위험특성을 설명할 수 있는 경험 데이터를 이용하여 요율산정 방식을 제안해 보았다. 본 연구의 한계점 및 향후 연구 계획에 대해 설명하면 다음과 같다. 먼저 이 연구에서는 실제로 실손의료보험에서 수많은 담보들을 보장하고 있는 현실을 고려하여 우선 GLMM에서 질병 담보 내에서 입원과 통원이라는 두 개의 담보를 복합적으로 고려하기는 했지만 추가적으로 둘 이상의 다양한 담보들을 포함할 수 있는 모형에 대해서는 고려하지 못하였다. 특히 추후에는 질병과 상해 모두를 포괄하여 분석할 수 있는 모형에 대한 고민이 필요하다고 본다. 분석과 제도 설계의 복잡성은 훨씬 커지겠지만 담보별 차이가 분명히 존재하기 때문에 GLMM 등에서 추가적으로 많은 담보들을 동시에 반영할 수 있는 연구의 필요 성은 충분하다고 생각한다. 또 다른 한계점은 과잉형벌화(overpenalization) 또는 이중 계산(double counting)이 발생할 수 있다는 점이다. 피보험자는 사 전적 요율변수에 의해 위험집단이 구분되는데 이러한 위험집단 내에서 본 연구 와 같이 등급별로 보험료를 차등화하게 된다면 고위험군에 더 높은 보험료를 이 중으로 부과하게 되는 문제점도 발생할 수 있다. 따라서 이러한 한계점을 극복하기 위한 보험료 산정 방식에 대한 연구 역시 필요하다고 본다. 본 연구가 이러 한 한계점에도 불구하고 공정한 요율산정 방식에 대한 활발한 논의가 진행될 수 있는 시발점으로서 실손의료보험과 보험 산업의 발전에 도움이 될 수 있기를 희망한다.\r\nIn Korea, new private health insurance have been sold since April 2017, allowing a 10% discount on insurance premium for the next year if benefits is not received for two years. As the number of policyholders to private health insurance increases, both interest and demand for the application of Bonus-Malus systems such as auto insurance are also increasing. Referring to insurance companies in overseas countries, methods of considering policyholders’ risk characteristics are mainly discussed in the method of rate making for PHI. However, in the case of PHI, it is necessary to be very careful when applying the rates differentiation methods. This study is meaningful in proposing a method of fair rate making to insured people by considering models to integrate multiple coverages rather than using individual models by coverage in the empirical rate making method considering the policyholder’s past insurance accident history. Under the current rate making systems of PHI, it is difficult for insurance companies to manage risks and controversy over equity in rate making has been steadily presented since it does not fully reflect differences in risk characteristics by policyholders. Therefore, it is necessary to study how to calculate premiums corresponding to each risk level for each policyholder. Starting with the necessity of such a study, this study proposed a rate making method using experience data that can explain the non-observation risk characteristics of policyholders. The limitations of this study and future research plans are as follows. First of all, considering the reality that PHI actually covers numerous coverages, a model that may include two or more various coverages was additionally not considered although this study considered two coverage: hospitalization and outpatient within disease coverage in GLMM. In particular, it is necessary to consider a model that can be analyzed comprehensively for both diseases and injuries in the future. Although the complexity of analysis and system design will be much greater, there is a sufficient need for research that can reflect additional coverages at the same time in GLMM and others because there is a clear difference between coverages. Another limitation is that overpenalization or double counting may occur. Insured persons are classified by pre-rate variables, and if insurance premiums are differentiated by level as in this study within these risk groups, there may be a problem of double charging higher premiums to high-risk groups. Therefore, it is also necessary to study the method of calculating insurance premiums to overcome these limitations. Despite these limitations, it is hoped that this study will help the development of PHI and insurance industries as a starting point for active discussions on fair rate making methods.\r\n6. references:\r\nKim, Daehwan, and Lee, Bongjoo. “An Analysis on Adverse Selection in Fee-For-Service Health Insurance.” Korean Insurance Journal 96 (2013): 25-50.\r\nKim, Daehwan. “Empirical Analysis of Maintaining and Canceling Behaviors of the Indemnity Private Health Insurance and Its Implications.” Korean Insurance Journal 108.0 (2016): 29-54.\r\nYou, Changhoon, and Kim, Jeong dong. “A Study on the Determinants of Purchasing and Surrendering Private Health Insurance.” The Journal of Risk Management 22.2 (2011): 189-222.\r\nLee, Hangsuck, Lee, Gaeun and Lee, Kyoungah. “A Ratemaking of the Korean Private Health Insurance using GLM.” The Journal of Risk Management 28.4 (2017): 37-71.\r\nLee, Hangsuck, Lee, Minha and Baek, Hyeyoun. “An Empirical Analysis of Bonus-Malus System in Private Health Insurance.” Korean Insurance Journal 116 (2018): 33-66.\r\nChung, Sung Hee, and Lee, Jung-Taek. “Case and Implication of Application of Premium Differentiation System for Private Health Insurance.” KiRi Ageing Review 1 (2016): 9-12.\r\nCho, Jaerin, and Chung, Sung Hee. “A Study on the Improvement of Private Health Insurance from a Actuarial Perspective.” KiRi Research Report 2018.6 (2018).\r\nFinancial Supervisory Service. “Current Status of Loss Ratio in Private Health Insurance, etc. in the first half of 2018.” Press Release, Financial Supervisory Service, 2018.\r\nAltman, Daniel, David M. Cutler, and Richard J. Zeckhauser. “Adverse selection and adverse retention.” The American Economic Review 88.2 (1998): 122-126.\r\nChristiansen, Marcus C., et al. “Who is changing health insurance coverage? Empirical evidence on policyholder dynamics.” Journal of Risk and Insurance 83.2 (2016): 269-300.\r\nDe Jong, Piet, and Gillian Z. Heller. Generalized linear models for insurance data. Cambridge University Press, 2008.\r\nDenuit, Michel, et al. Actuarial modelling of claim counts: Risk classification, credibility and bonus-malus systems. John Wiley & Sons, 2007.\r\nFaraway, Julian J. Extending the linear model with R: generalized linear, mixed effects and nonparametric regression models, Second edition. Chapman and Hall/CRC: Florida, 2016.\r\nGoldburd, Mark, Anand Khare, and Dan Tevet. “Generalized linear models for insurance rating.” Casualty Actuarial Society, CAS Monographs Series 5 (2016).\r\nOh, Rosy, Peng Shi, and Jae Youn Ahn. “Implementation of frequencyseverity association in bms ratemaking.” arXiv preprint arXiv:1903.05851 (2019).\r\nTsai, Tsung-han, and Jeff Gill. “Interactions in generalized linear models: theoretical issues and an application to personal vote-earning attributes.” Social Sciences 2.2 (2013): 91-113.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-14T18:18:05+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-09-02-계리리스크관리 연구 동향 번역/",
    "title": "계리리스크관리 연구 동향 번역",
    "description": "번역 하던 중 실손의료보험관련 논문으로 교체.",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-09-02",
    "categories": [],
    "contents": "\r\n1. 초록\r\n본 연구는 지난 30년간(1990년부터 2019년 상반기) 한국리스크관리학회지인 「리스크관리연구」 논문에 게재된 계리 리스크관리 연구 논문 총 78편에 대해 논문의 주요 내용들과 시사점들을 리뷰한 것이다. 계리 리스크관리 연구 논문들의 연구 동향을 살펴보기 위해 시 대별·주제별로 그동안의 연구 성과를 주로 다루었다. 계리 리스크관리 연구는 전통적인 계 리 업무인 상품개발 관련 연구, 재무건전성에 관한 연구, 재보험과 ALM, ERM 등과 같은 계리 리스크관리 기법에 관한 연구들로 구분해 볼 수 있었다. 이러한 연구 논문들을 살펴본 결과, 계리 리스크관리 분야의 연구 주제가 2000년 이후 매우 세분화된 것에 비해 「리스크 관리연구」에 게재된 논문들은 일부 주제에 편중되어 있는 편이었고, 실증분석과 같이 수리 적 접근 방법의 논문들이 제도와 정책 연구 논문들에 비해 좀 더 많은 비중을 차지하고 있 었다. 이 결과들을 바탕으로 향후 새로운 분야나 다양한 연구방법론들을 다룬 논문들이 균 형 있게 「리스크관리연구」에서 다뤄지기를 기대해 본다.\r\nThis study reviewed the main contents and implications of the paper on the total 78 articles of the Journal of Risk Management published in the Korea Risk Management Society’s research paper over the past 30 years (from 1990 to the first half of 2019). In order to examine the research trends of the research papers on actuarial risk management, the research achievements were mainly dealt with by period and subject. The actuarial risk management research could be divided into the traditional actuarial work related to insurance product development, the study on financial soundness, and the reinsurance and the method of actuarial risk management such as ALM and ERM. As a result of reviewing these research papers, the papers published in the Journal of Risk Management were biased to some subjects, while the research topics in the field of actuarial risk management were very subdivided since 2000. And papers of the mathematical approaches, such as empirical analysis, have taken up more weight than those of policy research. Based on these results, we hope that future papers on new fields or various research methods will be dealt with in the Journal of Risk Management in a balanced manner.\r\n2. purpose of the study: 이전 선행연구 요약, 본 논문의 연구 목적\r\n본 연구에서는 과거 30년 동안 한국리스크관리학회지에 게재된 논문들 중 계리 리스크관리 연구 영역으로 분류할 수 있는 논문들을 대상으로 시대별, 그리고 연구 주제별 연구 성과를 주로 다루고자 한다. 한국리스크관리학회지가 최초 발행된 1990년 이후 2019년 상반기 말 제30권 2호에 이르기까지 약 4,000여 편의 논문이 발표되었다. 그 중 계리 리스크관리 영역에 속하는 논문은 총 78편에 달하고 있으며, 논문들의 대분류 주제(계리 리스크관리, 생명보험, 손해보험, 연금, 보험이론 및 경영 등) 기준으로는 계리 리스크관리 분야가 약 20%를 차지하고 있었다. 계리 리스크관리 영역이 포함하는 주요 연구 내용은 다음과 같이 구분할 수 있다. 첫째, 보험회사에서 계리사의 주 업무에 관한 내용으로 전통적인 계리 업무로 볼 수 있는 상품개발에 관련한 사망률, 할인율, 해약률 등에 대한 내용을 있다. 둘째, 재무건전성에 관련된 법규, 부채평가, Solvency 및 수익성, 자본관리, 준비금 산출 방법 등에 관한 리스크관리 내용을 주요 연구 내용으로 들 수 있다. 그리고 마지막으로 계리 리스크관리 기법인 재보험, 자산부채 종합 관리(ALM), 전사적 위험관리(ERM) 등도 포함할 수 있다. 이와 같이 과거 게재된 논문들의 연구 성과를 되짚어 보는 것은 매우 의미 있는 작업이라 생각한다. 과거의 연구 추이를 살펴봄으로써 계리 리스크관리 연구 분야의 역사를 재조명할 수 있고, 본 연구를 향후 계리 리스크관리 분야의 연구에 참고자료로 활용할 수도 있을 것이다.\r\nThis study will mainly deal with the research achievements of each period and subject of research for papers of the Journal of Risk Management published in the Korea Risk Management Society’s research paper over the past 30 years that can be classified as actuarial risk management research areas. Since 1990 when the Korea Risk Management Society’s research paper was first published, about 4,000 papers have been published, ranging by Vol 30 No 2 in the first half of 2019. Among them, there are a total of 78 papers in the actuarial risk management area, and the actuarial risk management field accounted for about 20% of the papers based on their main classification topics (actuarial risk management, life insurance, general insurance, pension, insurance theory, and management). The main research that the actuarial risk management area includes can be divided into. First, it is about the main work of the actuary in the insurance company, including the mortality rate, discount rate, and lapse rate related to the development of products that can be seen as traditional actuarial work. Second, the contents of risk management related to liability valuation, solvency, profitability, capital management, reserving method, law which is about financial soundness and etc can be classified into major research contents. Finally, reinsurance, asset liability management (ALM) and enterprise risk management (ERM) and etc, which are actuarial risk management techniques, may be included. As such, reconsidering the findings of past papers is a very meaningful task. By looking at past research trends, it can shed light on the history of actuarial risk management and may be used as a reference for future research in actuarial risk management.\r\n4. analysis:\r\n시대별\r\n우리나라의 보험사들은 1990년대까지 미성숙한 보험환경으로 인해 리스크관리가 미흡한 상태이었다. 1990년대 후반에는 경제위기와 구조조정 등과 같은 사회, 경제적 환경 변화가 있었고, 2000년대 초반에는 보험상품의 요율 자율화와 제3분야 보험상품의 규제 완화, 그리고 지급여력제도 등 보험사의 규제 환경 변화로 상품개발과 리스크관리 방법의 선진화가 요구되기 시작하였다. 1990년대 초 연구들을 살펴보면 송일(1990), 이경룡(1990), 박승전(1992) 등 리스크관리에 대한 정의, 이론, 그리고 해외 국가와 다양한 산업에서의 리스크관리 사례들을 소개하는 방식으로 한국 기업들에게 리스크관리에 대한 필요성을 강조하는 동시에 리스크관리 학문의 발전을 위한 제안 및 향후 과제들을 제시하였다. 2000년대에 진입하면서 보험부채 평가 및 재무건전성 강화를 위한 보험감독 체계에 대한 관심도가 높아지기 시작하였다. 또한 더 실무적으로 적용 가능한 다양한 선진 기법들에 대한 연구가 실제로 이뤄지기 시작했다. 2010년 이후에는 계리 리스크관리 분야의 연구주제들이 그 이전에 비해서 매우 다양해지기 시작했다. 보험부채/자본평가, 보험감독 등에 대한 논문이 게재되었고 또한 사망률 관련 연구가 꾸준히 증가하기 시작하였다. 지난 30년간 계리 리스크관리 분야의 논문들을 시대별로 비교해본 결과, 주로 그 시대에 직면한 환경 변화에 선제적으로 대응하기 위한 연구들이 다루어졌으며, 또한 실제로도 보험, 금융시장의 다양한 금융상품들에 점점 더 고도화된 선진 기법들이 적용되기 시작하였다. 이러한 새로운 모형들에 대한 연구들로 인해 계리 리스크관리 분야의 연구 주제는 전통적인 계리 업무의 내용에서 점점 벗어나 확장되어 가고 있는 추세라 볼 수 있다.\r\n주제별\r\n개별 논문들을 범주화하여 구분한 결과는 Table 4와 같다. 지난 20년간 계리 리스크관리 분야의 게재된 논문들 중에서 빈번하게 등장하는 주제어들이 주로 보험사의 리스크관리를 위한 재무 건전성 규제에 관련된 내용들이었다. 다양한 계리 리스크관리 분야의 주제들 중 특히 보험사의 재무건전성 강화를 위해 적용된 제도들에 대한 도입 전후 효과, 도입 이후 제도의 개선을 위한 발전 방안 제안 등 보험사 관련 리스크관리에 관한 지난 30년간의 연구 논문들을 집중적으로 고찰해 본다. 1990년대까지는 국내 보험사에 대한 건전성 규제가 크게 까다롭지 않았으며, 건전성 규제 자체가 자산 감소 또는 부채 증가로 이어져 자본이 감소할 위험성을 평가하는 체계는 아니었다. (김해식, 2018) 그러나 1999년 3월에 EU식 지급여력제도가 도입되면서 초보적이나마 국내 보험시장에도 위험평가를 기준으로 한 자본규제가 적용되었다. 2003년부터는 제도가 안정기에 접어들었고, 금융위기 이후인 2009년에는 보험사가 직면한 리스크를 더 세분화한 건전성제도인 RBC(Risk-based Capital)지급여력제도를 도입하기 시작하였다. 또한 국제기구의 권고사항과 유럽 및 미국 등의 제도 개선 추진 내용을 고려하여 2014년에 재무건전성 감독제도 선진화 종합 로드맵이 제시되었다. 2017년에는 2021년부터 RBC 지급여력제도에서 K-ICS(신지급여력제도)로 전면 전환된다는 계획이 담긴 ‘신지급여력제도(K-ICS) 로드맵’이 제시되었다. 2018년 11월 국제회계기준위원회(IASB)가 보험사의 요청에 따라 새국제회계기준(IFRS17) 도입을 2021년에서 2022년으로 연기하기로 결정하면서 이에 맞춰 K-ICS도 1년 늦게 도입되는 것으로 연기된 상태이었다. 그러나 최근 2020년 3월에는 일부 보험사의 전산시스템 개발 준비 미흡 등을 고려해 국제회계기준위원회는 다시 한 번 IFRS17 도입을 2023년 1월 도입으로 1년 더 연장하였다. 새로 고안된 K-ICS의 적용 시점도 역시 더 늦춰질 것으로 전망된다.\r\n5. results: 결론 부분 전체 번역\r\nThis study analyzed the total 78 articles, which are classified as actuarial risk management fields, among papers of the Journal of Risk Management published in the Korea Risk Management Society’s research paper, published from 1990 to the first half of 2019, by period and subject, to identify the past and present of this field. Although it was difficult to mention all the papers in this study, we wanted to introduce representative papers based on insurance company-oriented risk measurement and management methods that can be seen as the definition of actuarial risk management. In the past, corporate managers used their capital as a buffer for risk management, but with the development of risk management techniques and risk measurement theories, risk can be managed much cheaper by a risk-dispersion method that transfers that risks factors to third parties by pricing risks held by an entity. The papers of Journal of Risk Management published in the Korea Risk Management Society’s research paper can be seen as also having took the lead in providing and informing various tools and techniques for risk management. With risk-oriented insurance oversight in place, researchers have suggested quantitative risk indicators as a measurement method of the risks that insurers faced, such as Value at Risk (VaR) model, and proposed method that ultimately reduce risk through calculating the risks inherent in an enterprise using option pricing model such as Black–Scholes model. In addition, many studies have been conducted to think about how to apply the system itself with the aim of strengthening financial soundness, and to suggest implication and problem-solving methods from the new system or theory of advanced oversea countries. As a result of examining the trends of research topics addressed by the time period, the subjects of published papers were mainly to introduce cases and techniques of advanced countries abroad as domestic insurers were less aware of the interest and necessity of using risk management methods, systems, and manpower. In the 1990s, after the financial crisis, etc., it began to become common to subdivide risks and measure the size of each risk using a metering model. Entering the 2000s, the world began to discuss establishing International Accounting Standards to meet the growing demand for reliable financial information prepared on a single basis. The introduction of the new International Accounting Standards does not just change the accounting standards, but also affects the overall process and systems of the entity, so Korea is making thorough preparations for its introduction. In line with this global trend, analyses of expected problems, introduction effects and etc also are included in studies in the Journal of Risk Management in case the application of IFRS17 to insurers. Also, around 2000 as the government’s regulatory and supervisory systems have been established similar to the type of developed countries, the subjects of the study began to be further subdivided, and empirical analyses began to increase. Based on the research results of actuarial risk management studies published in the Journal of the Korean Society for Risk Management for the past 30 years in this text, the tasks to be additionally proposed for the development of the journal in the future are as follows. First, although research topics in the field of actuarial risk management have been more subdivided since 2000, it can be confirmed that they are still concentrated on some topics. Therefore, further diversification of research topics is necessary in the future. Of course, the biggest risk facing insurance companies today is government regulation and supervision. Since Korea is aiming to introduce a new International Accounting Standard (IFRS17) in 2023, it is also a very important issue to have active discussions about it. However, when recalling that the journal is a place where new technologies and disciplines must be discussed practically and academically, it is necessary for Journal of the Korean Risk Management Society to make efforts to enhance the role in both exchanging knowledge of researchers and providing rising techniques to practitioners by further diversifying research topics. Second, it is necessary to publish papers of various analysis methods. Currently, papers that approach mathematically such as empirical analysis and papers related to institutional and policy research are published in the journal. Because both analysis of the effects of mathematical approaches and institutional research are necessary methods of writing papers to share study and knowledge with various people, what to propose here is that there needs to be an effort to ensure that the research can be shared in a balanced manner as a whole, without publishing papers that are biased towards either side. We hope that studies on timely issues will be published in the Korean Journal of Risk Management in the future, and that academic and practical studies on various topics and rising techniques can contribute to the development of the insurance industry.\r\n6. references: 참고문헌\r\n강중철, 이도수, 성주호. “장수리스크를 고려한 사망률 추정방법에 관한 연구.” 리스크관리 연구 17.1 (2006): 153-178.\r\n김광빈. “생보사의 현금흐름테스트기법에 관한 고찰.” 리스크관리 연구 11.1 (1999): 125-151.\r\n김동훈. “재보험 자율화에 따른 손보사의 리스크 관리전략.” 리스크관리 연구 5 (1995): 53-71.\r\n김동훈, 김광빈. “생보사 경영위기와 RBC 규제에 관한 연구.” 리스크관리 연구 9 (1998): 125-176.\r\n김세중. “극단치 이론을 이용한 고연령 사망률과 최대 생존연령 추정에 관한 연구.” 리스크관리 연구 24.1 (2013): 129-150.\r\n김해식. “Solvency Ⅱ 시행 전후 유럽보험시장과 시사점.” 연구보고서, 보험연구원 (2018).\r\n노건엽, 박경국. “IFRS4 2단계 하에서의 보험부채 평가목적 할인율에 관한 연구.” 리스크관리 연구 25.3 (2014): 73-111.\r\n노건엽, 박경국, 박찬원. “신지급여력제도(K-ICS)에서의 금리리스크 측정에 관한 연구.” 리스크관리 연구 30.1 (2019): 59-89.\r\n류건식, 정석영. “보험회사의 리스크관리 실태 평가.” 리스크관리 연구 12.2 (2001): 3-38.\r\n류건식, 정석영. “우리나라 보험회사의 리스크관리시스템 현황 및 실태분석.” 리 스크관리 연구 13.1 (2002): 233-262.\r\n류건식, 천일영. “생명보험사의 RBC제도 도입방안 연구.” 리스크관리 연구 13.2 (2002): 3-37.\r\n류근옥. “보험회사의 위험기준자본금을 평가하기 위한 현금흐름 시뮬레이션 모형 과 M&A 전략에 주는 시사점.” 리스크관리 연구 12. (1999): 75-113.\r\n마승렬. “임금과 할인율의 장기예측에 관한 연구.” 리스크관리 연구 12.2 (2001): 91-131.\r\n마승렬, 김경선. “세입자의 유형별 임차비용 부담 리스크 평가.” 리스크관리 연구 30.1 (2019): 91-122.\r\n박승전. “위험관리를 위한 종합금융전략의 기본모형.” 리스크관리 연구 2 (1992): 1-15.\r\n백철, 김현태. “Gompertz 사망함수의 모수추정과 연령기준 설정에 대한 통계적 방법.” 리스크관리 연구 27.3 (2016): 25-65.\r\n보험연구원. “보험상품 변천과 향후 과제,” 보험연구원 심포지엄 자료 (2018).\r\n선제우, 윤정연, 송성주. “포트폴리오 리스크 측정을 위한 Copula-normal inverse Gaussian모형.” 리스크관리 연구 29.1 (2018): 113-148.\r\n성주호, 김양균, 박찬웅, 강중철. “현행 표준사망률 산출체계의 개선에 관한 연 구.” 리스크관리 연구 16.2 (2005): 97-125.\r\n송일. “학문으로서의 위험관리의 위상.” 리스크관리 연구 1 (1990): 1-24.\r\n오창수. “국제회계기준도입에 따른 보험상품의 영향분석.” 리스크관리 연구 22.2 (2011): 159-188. 오창수,\r\n오수연, 오창영, 이성호, 이창욱. “Solvency Ⅱ 기준에 따른 보험부채평 가에 관한 연구.” 리스크관리 연구 23.1 (2012): 147-185.\r\n오창수, 유인현, 박규서, 강원재. “IFRS4 기준하의 보험부채평가에 관한 연구.” 리스크관리 연구 24.2 (2013): 99-122.\r\n오창수, 조석희. “지급여력비율 수준에 따른 회계정보의 가치관련성에 관한 연구: 손해보험산업을 중심으로.” 리스크관리 연구 24.2 (2013): 41-67.\r\n이강욱, 이동선. “규제환경 변화에 따른 금융업권별 영향 전망Ⅱ: 보험 IRFS 17 도입 진행경과 및 주요 쟁점사항.” 스페셜리포트, NICE Issue, NICE신용평가 (2017): 2-17.\r\n이경룡. “한국기업의 리스크관리 현황과 과제.” 리스크관리 연구 1 (1990): 67-100\r\n이경룡. “건설기업의 리스크관리 현황과 과제.” 리스크관리 연구 5 (1995): 133-166.\r\n이경룡, 김사영. “우리나라 제조기업의 리스크관리 현황과 발전과제.” 리스크관 리 연구 18.1 (2007): 3-37.\r\n이경룡, 김용호. “한국기업의 수출신용 리스크관리와 수출성과 분석.” 리스크관 리 연구 4 (1994): 1-27.\r\n이경룡, 이상림. “한국 생명보험기업의 지급능력 확보에 관한 연구.” 리스크관리 연구 4 (1994): 107-161.\r\n이광봉, 이창수, 정창호. “생보사 책임준비금의 평가를 위한 통계적 추정모형에 관한 연구.” 리스크관리 연구 14.1 (2003): 75-97.\r\n이긍희, 이명활. “Vine Copula를 이용한 금융그룹의 통합리스크 측정.” 리스크 관리 연구 28.3 (2017): 1-41.\r\n이봉주, 박동규. “손해보험사의 금리리스크와 기업 가치.” 리스크관리 연구 12 (1999): 43-74.\r\n이봉주, 이근창. “손해보험산업의 RBC 제도 도입에 관한 연구.” 리스크관리 연구 13.1 (2002): 63-100.\r\n이창수. “이자율 변동에 대한 확률모형의 적용 - 생명보험과 생명연금의 순보험 료 계산에의 응용.” 리스크관리 연구 4 (1994): 209-225.\r\n이해관. “미국 RIMS의 조직과 운영.” 리스크관리 연구 1 (1990): 149-170.\r\n이해관. “기업의 위험재무기법.” 리스크관리 연구 4 (1994): 51-64.\r\n이희찬. “가상시장 가치평가법을 이용한 산림보험료 산정에 관한 연구.” 리스크 관리 연구 15.2 (2004): 3-28.\r\n임준환, 문혜정. “신 지급여력제도와 자본관리 다변화.” KiRi 리포트 2019.1.7. 포커스, 보험연구원 (2019).\r\n정신동. “솔벤시2와 RBC제도의 비교분석-국내 보험회사 지급여력제도에 대한 시사점을 중심으로-.” 한국금융정보학회, 금융정보연구 2.2 (2013): 67-97\r\n정중영. “RBC 제도 도입에 따른 정책적 과제-미국의 경험을 중심으로-.” 리스크 관리 연구 17.2 (2006): 3-40.\r\n조재린, 김해식. “일반손해보험의 부채 시가평가와 보험위험계수 산출에 관한 연 구.” 리스크관리 연구 26.1 (2015): 125-151.\r\n조재훈, 김정호, 이항석. “재보험의 위험경감과 RBC.” 리스크관리 연구 25.2 (2014): 95-121.\r\n주민정, 김해식. “우리나라 보험 산업의 위기진단지표 개발에 관한 연구.” 리스크 관리 연구 15.2 (2004): 143-166.\r\n주효찬, 노준희, 이항석. “보험에서의 유동성 프리미엄 기간구조 추정.” 리스크관 리 연구 26.1 (2015): 93-123.\r\n황지연, Thao, B. T., 고방원. “Lee-Carter 모형의 베이지안 추정을 이용한 국가 별 사망률 개선추이에 관한 비교연구.” 리스크관리 연구 29.1 (2018): 89-112.\r\nJho, Jae Hoon and Jang, Jiwook. “Asymptotic Super(Sub) Additivity of the Value-at-Risk of Regularly Varying Random Variables.” The Journal of Risk Management 22.1 (2011): 181-202.\r\nKo, Bangwon, Jiraporn, Phonchewin and Yoo, Byoung Hark. “A Study on Reserving Multiple Life Insurances and Annuities: A Copula Approach.” The Journal of Risk Management 25.2 (2014): 35-58.\r\nLee, Hangsuck. “Pricing Barrier Options with Flexible Monitoring Periods.” The Journal of Risk Management 19.2 (2008): 3-27.\r\nNguyen, Tristan and Molinari, Robert Danilo. “Solvency Ⅱ-Considering Risk Dependencies-.” The Journal of Risk Management 21.1 (2010): 3-39.\r\n금융감독원. “新지급여력제도 도입수정안(K-ICS 2.0).” 금융감독원 업무자료, 2019년 7월 10일, http://www.fss.or.kr/fss/kr/bbs/view.jsp?url=/fss/kr/1240186854180&bbsid=1240186854180&idx=1562744969045&num=33&stitle=%E3%E6%C1%F6%B1%DE%BF%A9%B7%C2%C1%A6%B5%B5 %20%B5%B5%C0%D4%BC%F6%C1%A4%BE%C8(K-ICS%202.0. 2020년 6월 6일 접속.\r\n금융위원회. “보험회사에 대한 新.지급여력제도 도입초안 등 마련-보험권 국제회 계기준 도입준비위원회 제4차 회의 개최. 보도자료(2018a).” 대한민국 정책브리핑, 2018년 4월 5일, http://www.korea.kr/news/pressReleaseView.do?newsId=15626 2762. 2019년 10월 29일 접속.\r\n금융위원회. “「보험 자본건전성 선진화 추진단」 구성 및 제1차 회의 개최. 보도자료(2018b).” 대한민국 정책브리핑, 2018년 11월 27일, http://www.korea.kr/news/pressReleaseView.do?newsId=156305818&pageIndex=1&repCode=&repCodeType=. 2019년 10월 29 일 접속.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-15T13:53:05+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-08-20-지급여력제도와예금보험료의조화/",
    "title": "지급여력제도와 예금보험료의 조화",
    "description": "보험학회하계학술대회",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-08-20",
    "categories": [],
    "contents": "\r\n2021년 8월 20일 금요일 한국보험학회와 한국리스크관리학회, 한국보험계리사회 등 공동 주관으로 하계연합 학술대회가 열렸다. 이항석 교수님께서는 보험계리 세션 사회자로서 참여하시고 또한 발표자로서 “지급여력제도와 예금보험료의 조화”라는 주제로 발표하셨다.\r\n이 날 발표는 예금보험료의 계산에 관한 주제로 진행되었다. 예금보험제도란 보험회사의 파산 시 자산보다 부채가 많아져 일부 계약자에게 보험금을 지급하지 못할 경우에 파산한 보험회사 대신 예금보험제도를 통해 일부 지급이 이루어지게 하는 제도이다. 보험회사는 예금보험공사에 예금보험료를 납입하고 예금보험공사는 보험회사 지급불능 시 일부 계약자들에게 지급을 해주는 구조이다.\r\n이항석 교수님께서는 “보험회사가 리스크를 적절히 관리하면 재무적 지급불능 상황에 빠질 가능성이 낮아지므로 두가지 제도(지급여력제도, 예금보험제도)가 유기적으로 조화를 이루어야 한다는 측면에서 연구를 시작하게 되었다”고 말씀하셨다.\r\n예금보험료에 관한 기존의 연구는 부채의 만기가 정해져 특정 시점에 (만기 시점) 지급불능 상황이 발생한다고 가정하거나 자산과 부채의 모델에 jumps를 도입하지 못하였다. 이 두가지 문제점을 보완하여 자산과 부채의 모델에 jumps를 도입하고 early exercise가 가능하도록 한 부분에서 본 연구의 차별점이 있다고 설명하셨다.\r\n본 발표에서 흥미로운 지점은 자산과 부채의 상관계수ρ 가 커질수록 보험회사의 ALM 수준이 높다고 가정할 때 ρ의 크기가 증가할 수록 실제 국내 보험사의 데이터를 활용한 예금보험료율이 작아지고 자산 부채 비율을 증가시켰을 때에도 예금보험료율의 감소를 확인할 수 있었다는 것이다. 또한 부채의 jump size가 커질수록 예금보험료율이 상승하는 것도 확인할 수 있었다. 이러한 수치분석을 통해 보험회사로 하여금 예금보험료를 줄이기 위해 그들의 ALM수준과 재무구조 향상에 대한 인센티브를 제공한다고 결론을 내리며 발표는 마무리되었다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-14T17:52:52+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-06-08-A Change of the MultiPillar OldAge Income Security System/",
    "title": "A Change of the MultiPillar OldAge Income Security System",
    "description": "다층 연금 구조, 석사 3학기 퇴직연금강의 기말과제",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-06-07",
    "categories": [],
    "contents": "\r\n다층연금체계의 현황과 문제점에 대해서 논하시오\r\n1\r\n우리나라의 다층연금체계는 기본적으로 0층 기초연금, 1층 국민연금, 2층 퇴직연금, 3층 개인연금(사적연금)의 구조를 가지고 있다. 다양한 지점에서 문제점이 지적되고 있는데 몇 가지 문제점들을 꼽아보자면 1. 각 제도 간 역할과 기능이 연계되어 있지 않다는 점 2. 국민연금 납부비율, 소득유지 기능 약화가 진행되고 있다는 점 3. 퇴직연금의 경우 일부 정규직 근로자 중심으로 운영되며 대부분의 근로자가 퇴직연금제도를 의미 있는 노후소득보장 수단으로 인식하고 있지 않다는 점 4. 개인연금제도의 경우 중산층 이상의 소득계층 중심으로 가입이 이루어지고 있으며, 노후소득보장 수단 보다는 세제혜택을 위한 역할에 그치고 있는 점들을 꼽을 수 있다. 이러한 문제점들을 해결하기위해 다양한 논의가 계속되고 있다. 모든 나라의 연금 개혁의 두 가지 목표는 급여적정성(adequacy)와 지속가능성(sustainability)이다. 다만, 이 둘의 목표는 서로 상충되기에 결국 연금 개혁안은 두 목표를 조화 혹은 절충하는 작업이다. 이 두가지 목표 하에서 제기된 문제점들에 대한 해결책을 모색해야 한다.\r\n2\r\n먼저, 연금 개혁 이전에 연금 정보의 폭넓은 전달 강화가 필요하다는 점을 꼽고 싶다. 무엇보다도 중요한 지점은 연금 수요자들에게 자신의 미래 연금 소득 수준이 어떻게 변화할 수 있는지, 현재 자신이 납부하고 있는 보험료의 수준은 어떻게 산정되고 있는지, 자신의 생애 혹은 상황에 맞추어서 자신의 연금 생활을 선택할 수 있는 폭을 넓이기 위해 자신이 현재 속해 있는 연금제도에 관한 다양한 정보를 얻을 수 있도록 해야 한다. 이를 위해선 가장 먼저 연금 계층간 역할과 기능이 연계되고 이를 함께 논의하고 포괄할 수 있는 조직이 필요하다고 생각한다. 즉, 국민연금 따로, 퇴직연금 따로 기초연금 따로 개인연금 따로 운영 주체에 따라 각각의 정보만은 수요자에게 전달하는 수준에서 머무는 것이 아니라, 각 계층에 수요자가 교집합으로 속할 테니 각각의 제도가 이러한 수요자 맞춤 정보를 함께 제공할 수 있는 체계를 갖추는 것이 필요하다고 생각한다.\r\n3\r\n두번째로 공적 연금과 사적 연금 간의 역할 분담의 명확화가 필요하다고 생각한다. 사적 연금의 경우 우리나라에서 대부분 중산층 이상이 가입하고 있으며 사적 연금이 국민 전체 개인의 노후 소득 보장에 큰 역할을 담당하고 있지 않고 그저, 세제혜택을 위한 도구로서 사용되고 있다는 점은 안타까운 현실이다. 그렇기에 영국의 사례처럼 공적연금은 빈곤층을 위한 제도로서 사용되고 사적연금 제도를 강화하여 대부분의 국민들이 사적연금제도를 통해 실질적인 노후 보장을 진행하는 것이 연금 개혁의 적절한 방향으로 생각된다. 무엇보다 기초연금의 경우는 대상이 65세 이상 국민 전체를 목표로 하고 재정 방식이 부과방식으로서 당해 세대에 재정 책임이 있기에 사적연금의 강화는 필히 이러한 기초연금의 재정 방식에 대한 변화를 가지고 올 수 있을 것이다. 즉, 사적 연금의 강화는 필히 개인의 연금 조성에 대한 시각을 바꾸며 개인이 자신의 노후 보장을 위해 사적 연금 재정을 꾸려 나가야하기 때문에 이러한 부분이 기초연금 뿐 아니라 국민연금에 대한 재정 부담도 줄일 수 있는 요인이 될 것이다. 국민연금의 경우 재정방식이 부분적립방식으로서 부분사전적립하고 나머지는 미래세대에 재정 책임을 이연하는 효과가 발생하므로 세대간의 갈등이라는 오래된 주제는 점점 줄어들 수 있다. 또한 국민연금이 갖는 소득 보장 기능의 하락과 재정에 대한 끊임없는 부담은 범 정부적인 차원에서 국가안의 문제로서 존재하므로 사적 연금 제도의 강화는 국민연금에 대한 여러가지 문제점들을 또한 완화시키는 요인으로 작용할 것이다.\r\n4\r\n물론 각 제도가 가지고 있는 고유의 문제점들이 모두 존재한다. 하지만 이러한 문제점들은 점진적인 연금 개혁을 통해 해소될 수 있다고 본다. 문재인 정부는 연금제도와 공적 보험에 있어서 범 정부적 차원의 공적 제도 역할 강화를 이어왔다. 하지만 이부분은 단순히 정치적 논제로서 다루어져야 할 것이 아닌 현실적인 실현 가능한 대안으로서 미래의 국민들의 노후소득보장의 청사진이 되어야 한다. 즉, 공적 연금강화는 물론 현재의 상황과 정치적 환경을 고려한 조치이지만 이는 점차적으로 사적 연금강화라는 방향으로 옮겨가야만 한다고 생각한다. 국가가 국민 모두의 노후를 보장해 주어야 한다는 주장의 의미는 단순히 정치적 주장이 아니라 경제적 현실적 결함을 갖는다고 생각한다. 국민연금 재정방식에는 사적연금의 오랜 보험료 산출 원리인 수지 상등의 원칙이 적용되지 않는다. 이는 우리에게 많은 시사점을 준다고 생각한다. 80년대와 90년대 고도의 성장기를 거쳐왔던 시기엔 대한민국의 미래 성장 가능성에 힘입어 충분히 국민연금의 재정방식에 대한 부담이 없었다고 본다. 하지만 성장세가 점점 꺽여가는 고도화된 대한민국의 현실에서는 현재의 국민연금 재정방식이 갖는 문제점은 분명하다. 그렇기에 제도적으로 공적연금의 기능은 현재 기초연금이 갖는 기능으로 축소하고 더불어 빈곤층에 대한 보호를 공적연금이 할 수 있는 방향으로 진행하며 사적연금 제도의 강화를 통해 대다수의 국민들이 노후를 보장해가는 체계의 마련이 필요하다고 생각한다. 사적연금의 강화는 현재 보험회사들의 역할 강화와 맞물린다. 보험 본래의 기능과 실제 보험회사에서 보험료가 산출되는 구조를 본다면 전적으로 공평하며 각각의 계약자 개인이 갖는 위험을 진단하여 보험료를 산출하기에 개인의 노후 보장뿐 아니라 기관 투자의 역할 강화로서 국가적 차원의 투자 재원 마련으로 국가 경제에 이바지할 수 있다고 본다. 미시적으로 본다면 단순히 개인의 노후 보장을 개인에게 맡기는 것으로서 보일 수 있지만 결과적으로 이 기금을 운용하고 위험을 분류하여 보험료를 책정하는 보험회사의 관점에서 보면 개인의 이러한 노후에 관한 경제적 리스크는 대수의 법칙을 통해 분산된다. 즉, 사적 연금 강화가 개인의 노후를 개인에게만 맡기는 무책임한 의미가 아닌 개인이 갖는 위험을 적절히 평가하여 그 위험에 맞는 공정한 보험료를 책정하고 이를 비슷한 위험을 갖는 계약자간 위험을 분산시키는 의미로 볼 수 있다. 국민연금이 갖는 투자 운용에서의 이점은 분명히 존재한다. 이러한 점을 고려해본다면 독일의 실손보험제도와 비슷하게 보험회사들의 언더라이팅 기능과 보험료 부과 기능은 살리면서 국민들의 노후보장을 위한 연금 기금에 대한 운용은 국민연금과 같은 국가적 차원에서 투자 운용을 해가는 것이 필요하다고 본다. 이러한 구조로의 변화 혹은 개혁은 현재 국민연금이 갖는 미래 세대에 대한 재정 책임 이연에 대한 문제를 해결할 수 있다. 기초연금의 경우 국가 차원의 복지 제도로서 생각한다면 충분히 용인될 수 있고 퇴직연금 또한 사용자와 노동자가 함께 부담하며 근로자의 노동 소득에 맞추어 설계되어 있어 용인될 수 있지만 국민연금의 경우 필히 갈등을 가지고 올 수 밖에 없는 구조라 생각한다. 그러므로 국민연금의 역할에 대한 점진적인 개혁이 국가 차원 다층연금제도 개혁에 가장 중요한 부분을 차지할 것이다 생각한다.\r\n5\r\n한편, 코로나 사태 이후 주식시장에 동학 개미로 불리우는 많은 개인 투자자의 유입이 있었고 이러한 움직임이 금융 문맹 퇴치와 이어지고 또한 개인의 노후보장에 대한 인식 환기로서 작용하는 부분이 있다고 생각한다. 개인의 노후가 개인의 책임이다 라는 주장은 복지국가로서 대한민국에는 어울리지 않아 보인다. 하지만 개인의 노후가 개인의 준비를 필요로 한다는 지점은 모두들 동의할 것이다. 이러한 개인의 노후 준비에 있어서 가장 중심적인 부분을 차지할 것이 바로 다층연금제도일 것이다. 그렇기에 다층연금제도 자체에 개인이 자신 노후를 준비할 수 있는 선택의 폭이 필요하며 이는 단순히 공적 연금이 노후를 보장해 준다는 정치적 논의를 넘어서 실제적이고 경제적이며 현실적인 준비로서 사적연금제도의 강화가 이를 도와줄 수 있다고 본다. 또한, 앞서 제안한 연금 정보 통합 조직의 구축은 이러한 연금 개혁의 중추적 과제로서 사적연금제도 강화와 함께 진행되어야 할 것이다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-09-15T13:59:46+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-04-26-Insurance Accounting and Discount rate/",
    "title": "IAD part 2",
    "description": "From Lecture, Insurance Accounting and Discount rate",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-04-26",
    "categories": [],
    "contents": "\r\n전체적 구조: IAA의 Discount rate 모노그래프를 통한 할인률의 이해\r\n교재 Ⅵ-26 Term Effects (기간 효과)\r\n특정 시점에 수익률 곡선의 기간구조를 지정하는 방법은 여러 가지 있다. 이 모노그래프에서는 현물이자율과 선도이자율이라는 두 가지 접근방식에 초점을 맞춘다. Spot Curve를 만드는 목적은 쿠폰의 수준이나 만기 든 상관없이 할인할 수 있는 능력을 갖추기 위해서이다. 앞서 설명된 YTM의 문제는 쿠폰 타입이나 만기에 의존하는 이자율 이였다. 그렇기에 할인율로서 적절치 않다. YTM은 특정 채권의 내부수익률을 나타내는 정보에 불과하다. 범용성이 부족하다. 채권상품구조를 바꾸면 할인율로서 사용될 수 없다.\r\n벨류에이션은 원하는 현금흐름을 적절이 할인하여 현재가치로 만드는 작업이다. 그때에 쓰일 수 있는 할인율을 결정할 때에 Yield Curve가 등장한다. \\((1+i_{t})^t\\) *principal 여기에서 \\(i_{t}\\)가 연간 현물이자율에 해당한다. 수익률곡선의 미래 움직임을 결정하기위해 여러가지 모형들이 사용되고 대표적으로 Vasiceck model, hull-white model, Cox-Ingersoll-Ross model 등이 있다. 이러한 모델들은 차익 기회를 피하도록 조정된다. 미래의 시점에 사용될 현물이자율 곡선을 만들어내는데 이러한 모델들이 사용된다. 컬리브레이션은 시장가격과 이론가격을 갖게 만들어주기 위해 모수를 맞추어 주는 작업이다. Vasiceck과 CIR 모델과 Hull-white 모델은 다르다. Hull-white 모델은 기본적으로 무이표채권에 대해서 이론가격과 시장관찰 가격이 일관되게 만들어내는 모델이다. 그렇기에 Hull-White 모델은 Arbitrage Free 모델이라고 한다. 기초자산의 가격을 일치시키거나- (Vasiceck, CIR), Hull-White 모델의 경우 파생상품의 가격 일치를 통해 컬리브레이션한다.\r\n수익률 곡선의 형태(shape)를 설명하는 데에 일반적으로 인용되는 세가지 이론이 있다. 시장세분화이론, 시장기대이론, 비유동성프리미엄 이론.\r\n시장세분화 이론이란 예를 들어 짧은 듀레이션의 자산은 트레이더들에게 어필될 것이고 긴 듀레이션의 자산은 연기금이나 생명보험회사들에게 어필될 것이다. 즉, 듀레이션 기간에 따라 자산의 시장은 서로 분리되어 독립적으로 작용하며 각각의 수익률은 투자자들의 선호에 따라 결정된다는 이론이다.\r\n시장 기대 이론이란 투자자들이 평균적으로 기대하는 미래이자율을 반영하는 것이 채권수익률의 기간구조라는 주장이다.\r\n비유동성 프리미엄이론이란 투자자들이 유동성을 선호하여 만기가 긴 채권일수록 장기간 투자하는 대가로 기대 단기 이자율 외에 추가적인 프리미엄을 요구한다고 주장하는 이론이다. 비유동성 프리미엄과 유동성 프리미엄은 동일한 의미이다.\r\n비유동성 프리미엄이론은 비유동성 프리미엄과 수익률 곡선의 형태 사이에 가능한 연관성이 있음을 제안한다. 이 점은 Amihubd 가 제기하는데 이는 미국재무부(장기)채권 수익률에도 비유동성프리미엄이 존재함을 보여준다. 단기 채권은 장기 채권보다 더 유동적일 수 있으며, 이는 시간경과에 따라 상승하는 수익률 곡선을 야기할 것이다.\r\n유동성 프리미엄은 항상 양(+)의 값이며 만기가 증가하면서 증가하기 때문에, 유동성 프리미엄이론에 의해서 제시되는 수익률 곡선은 항상 기대 이론에 의해서 제시되는 수익률 곡선보다 위에 더 급한 기울기를 지닌다.\r\n수익률 곡선에 영향을 줄 수 있는 또 다른 요인으로는 정치적 요인들, 양적 양화(QE)등이 있다. 먼저, 정치적 요인으로는 영국과 미국의 중앙은행들의 시중은행에 대한 대출 금리를 들 수 있다. 서브프라임 모지기 사태 이후 영국의 기준 금리와 미국의 목표 연방기금금리는 굉장히 낮은 수준을 유지하고 있다. (옮긴이 - 이 책이 발간된 시점을 고려해야한다.) 양적 양화는 또 다른 정치적 요인들이라고 볼 수 있다. 중앙은행의 통화공급량 증가를 위해 자산을 매입하는 과정에서 자산 매입은 해당 자산의 수익률에 직접적인 영향을 미칠 것이다. 예를 들면 QE에 의해 수요가 증가하므로 채권 가격이 상승하고 이로서 채권의 액면 가격은 그대로 인해 채권 가격의 상승으로 수익률은 감소한다. 이는 결국 수익률 곡선의 감소를 가지고 올 수 있다. 실증의 예로서 2010년 2월 10일에 영국 은행은 금융위기에 대한 반작용으로서 200B에 해당하는 자산을 매입했다. 대부분의 자산 구성은 국채였고 영국은행 연구소는 이러한 QE가 약 1%가량의 국채 수익률을 낮추었다고 지적했다.\r\n위의 논의의 대부분은 명목 할인율, 즉 인플레이션에 대한 조정이 없는 할인율에 초점을 맞추고 있다. 실질 수익률 곡선이 더 적절한 경우가 존재한다. 대표적인 예로 인플레이션 조정 연금부채를 평가할 때이다. 인플레이션에 대한 더 깊은 논의는 Discount Rate in Financial Reporting (2013)의 10장 Inflation을 참고하기 바란다. (계속)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-12T01:32:45+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-04-16-Mack Model/",
    "title": "Mack Model",
    "description": "Stocastic Reserving",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-04-16",
    "categories": [],
    "contents": "\r\nIntroduction\r\n미지급 손해액 결정에 있어서 기존의 결정론적 방식의 적용은 소위 점추정치를 구하는 구조이다. 많이 알려져 있는 CLM방식은 upper 삼각형의 관측데이터를 모델에 fitting하고 fitting된 모수들(LDF)를 사용하여 곧바로 미래의 미지급 손해액을 예측한다.(FORCAST) 이러한 CLM방식은 관측데이터변화에 따라 민감하게 반응한다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-04-02-Insurance Accounting and Discount rate/",
    "title": "IAD part 1",
    "description": "From Lecture, Insurance Accounting and Discount rate",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-04-02",
    "categories": [],
    "contents": "\r\n전체적 구조: IAA의 Discount rate 모노그래프를 통한 할인률의 이해\r\n발표자료: Section II. 할인 시 목적과 목표- 이해관계자의 관점 설명 슬라이드 이후\r\n도입: 월간 보험 통계를 이용한 손해보험회사의 준비금 현황 확인\r\n학생: 손해보험협회 월간 보험 통계에 들어가서 교수님께서 말씀하신 데이터를 찾아보았다. 손해보험협회에 등록되어 있는 손해보험회사들 목록이 나오고 종목별로 수입보험료 현황이 월별로 표시되어 있습니다. 교수님께서 말씀하신 대로 장기 상품이 다른 상품들에 비해 훨씬 수입 보험료 현황이 크고 파일을 받아서 엑셀로 열어 보았는데 장기 퍼센트를 계산해보았는데 대부분이 60%이상이며 80% 이상하는 회사들도 굉장히 많이 있다는 것을 알 수 있었다.\r\n교수님: 여러분이 보험회사를 가려고 하면서 보험회사를 모른다. 보험료수입에 대한 통계자료 맞나요? 보험료 수입이 이러한 통계를 보이면 준비금은 어떤 식일까요? 상상을 해보자.\r\n일동: 장기상품의 경우 준비금 금액이 휠씬 더 클 것 같습니다.\r\n본론 1: IFRS17의 도입에 따른 손보사에 비해 생보사가 어려움에 직면한 이유\r\n사고가 발생한 경우만 지급준비금으로 쌓여 있게 될 것이다. 장기 상품의 경우 보험료 들어온 것과 준비금과 비슷하다. 미경과 보험료 이런 것 이기 때문이다. 사고 난 것은 장기의 경우 지급 비금으로 쌓인다. 돈의 흐름을 재무제표를 보고 이해할 수 있어야 한다. 장기로 가면 준비금이 많고 IFRS17의 경우 손보사는 부담이 적다. 그렇다면 기간이 문제는 아닌 듯하다. IFRS17의 경우 무엇이 부담을 주는가? 보험상품에 이자율이 어떻게 부리되는가를 생각해야한다. 생명보험상품의 속성과 손해보험회사의 상품의 속성을 이해해야한다. 분자의 현금흐름을 만드는 곳과 분모의 할인율에 모두 이자율이 사용된다. 현금흐름을 만드는데 쓰이는 이자율과 할인에 쓰이는 이자율의 속성이 같은가? 지금 우리는 무엇을 하는가? 부채평가를 한다. 즉, 상품계약시에 계약자에게 제공하는 현금흐름에 적용되는 부리이율과 그 전체 현금흐름을 할인하는 할인율이 존재한다. 부리이율과 할인율과는 관계없다. 부리이율은 상품계약과 관련된 이율이다. 과거의 경우 부리이율이 확정 이율이 많이 존재했다. 점점 확정형 부리이율이 아닌 변동 이율을 적용되었고 그것이 시중에 공시된다고 하여 공시이율이라고 하였다. 그러므로 과거의 확정형 상품에서 변동형 상품으로 전환이 많이 되었다는 것을 알 수 있다. IFRS17의 도입에 따라 생명보험회사가 어려움에 처한 것은 결국 과거에 높은 확정 이율로 판매한 상품이 많기 때문이다. 지금은 고객 보호를 고민하기 보다 보험회사의 재무건전성을 고민해야 할 때이다.\r\n본론 2: 공시이율과 할인율, 위험률, 해약율 결정의 중요성\r\n손해보험사의 경우 장기 상품이 높은 비율로 금리연동형 상품이다. 이유는 장기 보험을 판매한 것이 오래된 일이 아니기 때문이다. 장기보험의 경우 생명보험에 비해서 만기가 짧다. 옛날의 확정형 계약들은 장기의 경우 상대적으로 짧은 만기로 계약이 종료되었다. 보험부채 평가시에 분자의 현금흐름을 프로젝션하여 할인율을 사용해 할인해서 현재가치를 측정한다. 할인율만 잘 정한 것으로 충분치 않고 분자의 부리이율과 여러 가지 위험율의 결정도 또한 몹시 중요하다. 분자에 들어갈 공시이율 모델링의 문제가 존재하고 각종 위험율과 해약율을 결정하는 것이 할인율 결정만큼 중요하다는 것을 인지해야만 한다. 부채평가에 있어서 분자와 분모 즉, 현금흐름과 할인율 측면에서 고려되야 할 것이 많이 때문에 복잡한 모델을 사용하는 것은 지양해야 한다. 전문가로서 합당하게 제시할 수 있어야 한다. 최근에 보험학회에서 저는 보험회사들의 공시이율 결정 매커니즘을 밝히고 부채평가시 공시이율 모델링이 간단해도 된다는 것을 이야기했다.\r\n본론 3: 최저보증이율 – 할인율 공부의 필요성에 대하여\r\n과거 금융감독원은 금리연동형 상품에 최저보증이율을 적용하라고 지시하였다. 만약 계산한 공시이율이 최저보증이율보다 낮을 경우 고객에게 최저보증이율을 부리이율로 적용해야만 한다는 의미이다. 앞선 경우 최저보증이율이 적용됨에 따라 자산이익율이 감소하고 공시이율 모델에 있어 자산이익율의 감소는 공시이율의 감소를 가지고와 결국 최저보증이율로 수렴하여 금리연동형 상품이 실상 금리확정형 상품이 되어버린다. 금리확정형 상품의 문제는 프로젝션된 현금흐름을 나타내는 분자는 상수가 되어버려 분모인 할인율이 변동에 따라 부채평가액이 심하게 변동되기 때문에 문제가 된다. 물론 이 부분은 준비금 평가에 있어 문제가 되는 부분이다. 손익측면에 있어서 문제가 되는 것은 버는 돈에 비해 더 많은 돈이 나가게 된다는 것이다. 자산이익율의 감소로 야기된다. 예를 들어 금리 10%로 팔았는데 자산이익율 6%라면 금리 역마진으로 보험사는 손해를 보게 된다. 결론적으로 부채 평가에 있어서 핵심적 원인은 금리확정으로 인해 분자와 분모가 같이 움직이지 못하기 때문이다. 금리연동형 상품을 많이 판매하여 보험사들의 손익이 많이 좋아졌다. 그럼에도 최저보증이율로인해 앞서 언급한 바와 같이 금리확정형으로 변화될 위험이 있고 보험부채의 변동성이 존재하게 된다. (분자와 분모가 함께 바뀌면 즉, 공시이율과 할인율이 외부 충격에 따라 같은 방향으로 움직여 보험부채의 변동성은 줄어든다.) 할인율 공부의 이유가 충분히 설명되었을 것이다.\r\n본론 4: 할인율 선택 시 이해관계자의 관점을 고려, 위험 조정에 대하여, 주인과 대리인 문제(정보에 대하여)\r\n이해관계자의 관점은 할인율 선택 시 고려되야 한다. 규제당국은 지급여력에 관심을 가질 경우, 할인율에 위험조정을 반영한다. 여기에서 위험조정은 비율로서 표현된 것이며 IFRS17상 위험조정은 준비금의 변동폭으로서 금액에 해당한다. (옮긴이-일반보험의 예를 들면 신뢰구간을 75%로 할 경우 확률론적 방법에 의해 미지급 손해액 추정액을 현 시점 지급된 것을 빼 그 총량 결과의 예측 분포를 생성하여 75%에서 mean을 뺀 것을 RA로 측정한다.) IFRS17의 RA는 주주에게 돌아가야 할 부분이다. 외부감사인의 경우 공정가치표시에 관심을 가질 경우, 외부적으로 관찰 가능한 요소를 고려하여 할인율을 선택한다. 최종적으로 보험회사의 할인율을 선택하는 보험계리사의 경우 앞서 말한 이해관계자들의 관점을 고려하여 할인율을 선택한다. 보험회사를 둘러싼 이해관계자들 예를 들어 규제당국은 규제를 만들고 주주들은 투자 금액을 회수하거나 추가하므로 계약자들은 계약을 해지하거나 유지하여 보험회사가 소위 엉뚱한 행동을 못하도록 한다. 즉, 의사결정이 제한된다. 주주와 대리인 문제에 있어 이해관계자들 보다 더 나은 대리인의 최대 장점은 정보다. 대리인은 정보를 가지고 자기 나름의 의사결정을 진행한다. 이해관계자의 경우 공시된 자료만 갖는다 규제당국조차 생각보다 적은 정보를 갖게 된다. 그러므로 대리인의 의사결정이 자신의 이익을 위함인지 주주에게 봉사하기 위함인지 알 수 없다. 대리인 문제는 결국 정보비대칭의 문제이다. 그러한 문제를 해결하기위해 여러가지 견제 장치들이 존재한다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-03-09-Loss Models/",
    "title": "Loss models",
    "description": "Loss models Abstract",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-03-09",
    "categories": [],
    "contents": "\r\nAbstract\r\n1\r\nLoss Models 라는 책 제목부터 생각해보자. Loss는 무엇인가? 자동차 사고가 났다고 상상해보자. 당신의 소중한 차 뒷 범퍼를 누군가 쳤다. 가해자는 내려서 연신 죄송하다 할 것이고 당신은 뒷목을…. 아니 차 상태를 확인하고 보험 처리를 할 것이다. 여기에서 뒷 범퍼 수리비가 loss가 된다. 물론 당신이 입은 허리 통증에 대한 치료비 또한 loss가 될 수 있다. 또 다른 예로 집에 불이 났다고 해보자. 집이 홀랑 다 타버렸다. 다행히도 당신의 집은 화재보험에 가입한 상태이기에 주택 전손에 대한 보험금을 보험사로부터 청구할 것이다. 여기에서 보험사의 담보에 따라 다르겠지만 화재로 손실된 주택의 가격이 곧 loss이다. 그러면 Models은 무엇인가? 현실 혹은 실제에 대한 모형을 의미한다. Loss model은 손해에 대한 모형이다. 그렇다면 손해에 대한 모형을 다루는 책이 loss models가 된다. 왜 손해에 대한 모형이 필요할까?\r\n2\r\n그에 대한 답이 파트 1인 INTRODUCTION에서 나온다. 계리학에서의 많은 문제들은 미래의 insurance cost를 예측하는데 사용될 수 있는 수학적 모델을 구축하는 것을 포함한다. 다시 말하면 loss에 대한 모델을 만들어 보험사가 미래에 당신의 뒷 범퍼 수리비(loss, 보험사 입장에선 cost)를 얼마나 지급해야 할지를 예측할 수 있다. 또한 그 예측을 바탕으로 보험사는 차 사고범에게 받을 보험료도 고려할 것이다. (보험요율 산정이나 준비금 적립에 관한 사항은 Loss Models의 범위를 벗어나기에 다른 서적을 참고하기 바란다.)\r\n3\r\nLoss와 모델에 대한 의미가 어느정도 이해되었을 것이라 생각된다. 파트 1을 넘어서 파트 2로 이동해보자. 파트 2 에서는 계리적 상황을 모델링하기위한 기본적인 확률 모델들을 다룬다. 여기에서 연속형 모델과 이산형 모델, 그리고 파라미터라는 개념이 등장하는데, 먼저 연속형 모델에는 다들 잘 알고 계시는 분포들이 등장한다. 정규, 지수, 감마, 파레토 등등의 분포가 등장하며 이 분포들은 손해액(loss)의 확률변수를 모델링하는데 사용될 수 있다. 마찬가지로 이산형 모델들 또한 등장한다. 이항, 포아송, 음이항 분포와 더불어 (a, b, 0) class, (a, b, 1) class 라는 개념들이 등장하고 Compound 된 빈도 분포들이 이야기된다. 이 이산형 분포들은 사건의 발생 횟수의 확률변수를 모델링하는데 사용될 수 있다. 미래에 보험사고가 몇 건이 발생할지 그리고 발생하게 된다면 얼마의 손해가 발생하게 될지를 연속형 분포와 이산형 분포를 통해 모델링하는 것이다. 이것을 통합적으로 생각하게 해주는 모델이 바로 책 9장에 등장하는 총손실모형 (Aggregate Loss Model)이다. 분포에 대한 설명은 이정도로 마치고 파라미터라는 개념을 알아보고 파트 3으로 넘어가보자.\r\n4\r\n파라미터란 무엇인가? 우리 말로는 모수라고 하는데, 모수는 우리가 관심있는 대상 즉, 모집단의 특성을 간략하게 함축하는 있는 개념이다. 앞서서 이야기한 연속형 분포와 이산형 분포는 모두 parametric distribution이다. 간단하게 말하면 이 몇 가지 모수들이 결정되기만 하면 전체 분포의 특성이 특징지어진다고 생각할 수 있다. 정규 분포의 예를 들어보면 정규 분포의 모습은 모수인 μ,σ의 결정만으로 확정된다. 그렇다면 이 모수들은 실제로 어떻게 구하는가? 차 뒷범퍼 수리비에 대한 모델링을 위해서 A손해보험사의 보험계리사 성균관씨가 이 문제를 고민하고 있다고 상상해보자. 자동차 사고에 대한 예상 손해액의 모델링을 하라는 지시가 내려왔고 성균관씨는 Loss Models에서 배웠던 내용을 상기하며 자동차 사고에 대한 예상 손해액에 적합한 분포를 파레토 분포라 확정 지였고 (models selection에 관한 방법론은 15장에 나온다) 파레토 분포의 모수 α,θ를 결정하려 하고 있다. 이 모수들에 따라 파레토 분포가 달라진다는 사실은 앞서 언급하였다. 이 모수들의 값을 결정하기 위해 성균관씨에게 필요한 것은 실제 자동차 사고 손해액 데이터이다. 이 실제 데이터를 통해 파레토 분포의 모수를 결정하므로 확정된 파레토 분포가 실제 현실과 잘 부합하도록 만드는 작업이 이루어진다. 이렇게 데이터를 통해 모수를 구하는(추정하는) 방법론은 수리통계학의 분야이며 Loss Models의 파트 3은 이러한 수리통계학을 다루고 있다.\r\n5\r\n자연스럽게 파트 3 수리통계학으로 넘어가보자. 점 추정, 구간 추정, 가설 검정에 대한 이론이 등장한다. 계리사들이 왜 통계학을 배워야 하는지 한편 통계학 전공자와 계리학 전공자의 차이 또한 드러나는 단원이다. 깊은 내용은 수업을 통해 들으실 수 있고 간략히 정리하면 앞서 말한 모델의 모수 추정은 MLE를 통해 이루어지게 된다. 그 외에도 적률추정법 혹은 퍼센타일 매칭 기법이 있기도 하다. 수리통계학의 마지막 단원은 13장 베이지안 추정 단원으로 몹시도 흥미로운 단원이다. 사전 분포와 사후 분포, 모델 분포의 용어와 관계에 익숙해지게 될 것이며 무엇보다 파트 5의 신뢰도 이론에서 베이지안 신뢰도와 문법을 공유하기에 베이지안 통계의 아이디어를 깊이 이해하는 것은 몹시 필요하고도 재미있는 일이다. 이해를 돕기 위해 하나의 예시를 들고 이 단원을 마무리하겠다. 앞서 계리사로 등장했던 성균관씨는 대학원 시절 계리학을 전공하였고 열심히 수업에 참여하며 동시에 계리사 자격증을 취득하기 위해 열심히 공부하였다고 상상해보자. 성균관씨의 동료 대학원생은 처음 성균관씨를 만났을 때에 성균관씨의 계리사 시험 합격률을 0.4로 판단했다고 한다. 하지만 성균관씨와 학기 수업을 진행해가며 성균관씨를 관찰한 결과 성균관씨의 학업 성실성을 바탕으로 성균관씨의 계리사 시험 합격률을 0.7로 판단하게 되었다 라고 해보자. 베이지안의 아이디어는 관찰 혹은 경험을 바탕으로 고정된 특정 대상의 성질(합격률)에 대한 판단을 바꾸어 가는 과정으로 볼 수 있다. 즉, 학기 수업을 진행해가며 성균관씨에 대한 합격률을 상향 조정하게 된 것은 성균관씨에 대한 관찰을 바탕으로 이루어진 것이다. 간략한 설명이 되었을 것이라고 생각하며 좀 더 깊은 수학적 모델은 Loss Models 교과서를 직접 참고하기 바란다.\r\n6\r\n이제 파트 3을 지나 파트 4로 넘어가보자. 파트 4는 경험적 모델의 구축과 모델 선택 방식을 이야기한다. 경험적 모델은 모수적 모델처럼 간단하게 소수의 모수로 설명할 수 없는 모델로 데이터 의존적 모델의 한 종류라고 이해하면 될 것 같다. (데이터 의존적 모델의 설명은 Loss Models를 참고하기 바란다.) 모수적 모델은 앞서 설명했듯이 몇 개의 모수들이 결정됨을 통해 모델의 모형이 확정되는 모델을 말했다. 그러면 경험적 모델은 무엇일까? Empirical model의 정의는 실제 데이터의 각각의 포인트에 1/n의 확률을 주는 모델을 말한다. 여기에서 n은 데이터의 개수를 말한다. 파트 4의 서두에도 나오지만 Empirical model은 기본적으로 “생존 분석” 이라는 분야에서 주로 연구되는 부분이다. 그럼에도 Lifetime을 모델링 하는 것에서 발생하는 문제들이 payments amount를 모델링 할 때에도 비슷하게 발생될 수 있어 경험적 모델이 loss models의 14장에 포함된 것이다. 이 단원에서 주의 깊게 봐야할 개념은 Kaplan–Meier와 Nelson–Aalen estimator이다. 재미있는 사실은 4판과 5판의 차이가 이 부분에서 나타나는데 Kaplan–Meier estimator를 구할 때에 요소가 MLE라는 것이 4판에서는 증명이 안되어 있는데 5판에는 증명이 간략하게 주어져 있다.\r\n7\r\n파트 4의 경험적 모델 부분이 끝나면 15장 모델 선택 단원이 나온다. 주어진 데이터에 어떠한 모델을 선택하여 모델링을 진행하는 것이 주어진 데이터를 잘 보여줄 수 있는지에 대해 논하며 검증 방법과 원칙에 대한 설명이 이루어진다. 잘 알려진 likelihood-ratio 검정, chi-square 검정, Kolmogorv-Smirnov 검정 등등의 정의와 쓰임새가 나오고 Judgment-Based Approaches, Score-Based Approaches 라는 두 가지 접근 방식을 논한다. 자세한 내용은 직접 Loss Models의 15단원을 읽어 나가시길 추천한다.\r\n8\r\n파트 5는 신뢰도 이론을 다룬다. 하나의 예시를 들어 설명을 이어가겠다. 앞서 A손해보험사의 성균관씨는 자동차 예상 손해액 모델링 프로젝트를 성공리에 마친 후 점심 식사 중 실손의료보험 상품 관련 업무를 담당하시는 선배 계리사로부터 이와 같은 푸념 섞인 농담을 듣게 된다. “아, 나일롱 환자들이 너무 많아서 그런 걸까? 아니면 감독원이 비급여 관리 방안에 대한 적절한 대안이 없어서 그런건지 원… 실손에서 손해가 계속되는데 우리 쪽에서는 손쓸 방도가 없네.” 이 말을 듣던 성균관씨는 씨익 웃으며 선배 계리사에게 “베이지안 아니 뷜만 신뢰도로 접근하면 되는 거 아닌가요?” 라고 의기양양하게 한 마디 하였지만 선배 계리사는 씨익 웃기만 할 뿐 말이 없었다. 이 예시에서 성균관씨가 말한 뷜만 신뢰도는 고전적 신뢰도, 베이지안 신뢰도와 함께 신뢰도 이론에 포함된다. 실손의료보험의 문제를 해결하기 위해 신뢰도 혹은 베이지안을 고려한다는 의미는 간단히 말해 환자의 실손보험료 결정 시 환자의 과거 경험 데이터를 사용하여 보험료를 조정하는 것을 의미한다. 즉, 과거에 많이 이용한 환자의 경우 그 경험 데이터를 반영하여 더 높은 실손보험료를 납부하도록 하는 식의 시스템을 고려하여 의료 과다이용으로 인한 회사의 손해가 줄어들도록 조치를 취하겠다는 의미인 것이다. 여기에서 조금 더 이론적으로 들어가 보면 고전적 신뢰도(최소 자승 신뢰도)는 데이터의 양 만을 고려하여 Z(신뢰도 계수)를 구해 조정하는 것이고 뷜만 신뢰도는 데이터의 양과 질 모두를 고려하여 요율 결정에 반영하는 것이다. 더 자세한 수학적 모델은 책을 참고하시면 될 것이다.\r\n9\r\n이제 마지막 단원인 파트 6을 이야기해보고 이 글을 마무리하고자 한다. 파트 6은 시뮬레이션 단원이다. 난수 추출법과 부스트랩 방법, 실제로 Var이나 CTE 시뮬레이션 등의 이론이 전개된다. 이 단원은 특히 소프트웨어를 이용한 실습이 이루어 져야 한다. R을 이용하거나 엑셀을 사용하여 실제로 책 속의 알고리듬을 직접 시뮬레이션 해보는 좋은 기회가 될 것이다. Loss Models에 대한 간략한 요약이 이로서 완료되었다. 직접 Loss Models를 읽어보므로 말씀드린 내용들을 음미해 보기를 바라며 앞서서 이야기했지만 소프트웨어를 통한 실습이 반드시 이루어져야 한다. (끝)\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-03-08-ALM/",
    "title": "ALM",
    "description": "ALM에 대하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-03-08",
    "categories": [],
    "contents": "\r\nIntroduction\r\n보험업은 다른 산업과 달리 리스크기반의 자본집약적 산업이다. 개인이나 기업이 갖는 리스크를 인수(Underwriting)하여 해당 리스크에 관한 보장을 제공한다. 그 중 생명 보험은 크게 3가지 영역에 대한 보장을 제공한다. 질병, 장해, 사망에 따른 보장 (보장성 상품), 미래 큰 지출을 위한 보장 (저축 및 자산 적립 상품), 퇴직 후 안정적인 소득 보장 (연금 또는 적립금 인출 상품). 한편, 손해보험은 광범위한 리스크에 대한 보장을 제공하는데 재물보험, 농작물보험, 홍수보험, 주택보험, 해상보험, 항공보험, 자동차보험, 의료사고배상책임보험 등 다양한 리스크를 보장하는 보험 상품을 제공한다. 보험회사는 보험계약자의 미래 손실을 보장해 주는 대가로 보험료를 받는다. 그리고 보험계약에 따른 보장의무는 곧바로 이행되지 않는 미래의 불특정한 시점의 의무이기에 부채로서 보험회사의 B/S에 나타난다.\r\n미리 받은 보험료는 미래의 보장의무를 이행하기위한 재원으로서 사용되지만 보험료 납입 시점과 보험사고 발생 시점사이의 차이는 보상의무를 고려한 적절한 보험료 재원의 투자를 요구한다. 결국, 보험회사는 보험료를 바탕으로 투자한 자산의 현금흐름과 인수한 보험계약의 보장의무를 나타내는 보험부채의 현금흐름 사이에서 회사 가치(순자산가치)와 수익을 최대화해야 하는 상황에 놓여 있다.\r\nAsset-liability management (ALM)은 보험회사 혹은 금융기관(은행 또한 같은 상황에 놓인다.)가 이러한 문제를 풀기위해 사용하는 접근법이다. 이제 ALM을 구체적으로 알아보도록 하자.\r\n1\r\n1980년대 초반 미국의 상호생명보험회사 Equitable은 10년까지 16% 이자율 보증을 제공하는 보험상품을 다수 팔았다. 이자율 보증을 충당하기위해 단기 이자율에 투자하였는데 단기 이자율의 붕괴로 장기의 높은 이자율 보증 수준을 커버하기엔 부족하여 회사에 위기가 닥쳐왔고 결국 Equitable은 탈상호화 하였고 Axa 그룹에 인수되었다. 이 사례를 통해 이후 많은 금융 회사의 매니저들은 견고한 ALM 체계를 만드는데 집중하였다.\r\n2\r\nALM은 금융기관이 자금 중개 기능을 하면서 발생할 수 있는 자산의 현금흐름과 부채의 현금흐름 사이의 불일치를 방지하기 위해 금리 리스크 뿐만 아니라 유동성 리스크(Liquidity risk) 관리를 목표로 개발되었다. ALM측면에서 보험회사는 보유한 자산과 부채가 노출된 리스크(Risk)의 성격과 자산과 부채사이의 관계에 대해 높은 수준의 이해가 요구된다. 보험부채는 상품설계에서부터 달라지기에 ALM에 있어서 보험회사는 상품 설계과정에서부터 마케팅, 경영전략, 자산 배분, 보험회사의 지급여력에 따른 요구자본까지도 고려해야 한다.\r\n3\r\n보험회사가 판매하는 상품의 특징에 따라 보험부채가 노출되는 Risk가 달라진다. 생명보험 상품의 경우 보험 기간이 장기로서 이자율의 변동에 따라 부채가 크게 변동하고 미래 현금흐름의 불확실성이 증가한다. 즉, 부채가 금리 리스크에 많이 노출된다.\r\n또한 생명보험상품이 갖는 보증옵션의 성격에 따라서도 다양한 리스크에 노출된다. 한편, 보험 기간이 단기이거나 갱신형인 손해보험상품의 경우 해당 보험부채는 금리 리스크에 적게 노출될 수 있지만 같은 손해보험인 경우에도 의료사고배상책임보험와 같은 상품은 클레임이 종결할 때까지 오랜 기간(long tail claims)이 걸리는데 이에 해당하는 부채는 필히 금리 리스크에 많이 노출된다. 그리고 자산에 있어서 보상액을 지급하기위해 보험회사는 채권이나 주식, 부동산 등의 자산에 투자하게 되는데 보험회사의 투자 포트폴리오에서 큰 규모에 해당하는 채권의 경우 가치가 금리의 변동에 따라 변동하기에 금리 리스크에 크게 노출된다.\r\n4\r\n보험회사는 미래에 지속적으로 발생할 보험금 등의 지급의무(부채)를 자산의 현금흐름으로 충족시켜야 한다. 정확한 현금흐름의 매칭은 현실적으로 어려움이 따르기에 그 대안으로서 이자율 변화로부터 포트폴리오의 가치를 보호하는 면역화 전략을 이용할 수 있다. 1952년 영국의 보험계리사 Frank Redington은 자산이 아래 조건을 만족시키도록 함으로써 이자율 변동에 대해서 비즈니스 포트폴리오가 어떻게 면역화되는지 보여주었다.\r\n시장 이자율 하에서 자산의 현재가치가 부채의 현재가치가 같을 경우\r\n자산 수정듀레이션(변동성)과 부채 수정듀레이션(변동성)이 같을 경우\r\n듀레이션 근처에서 부채의 컨벡시티가 자산의 컨벡시티보다 작을 경우\r\n특정 이자율 수준에서 면역화가 달성되고 나면 이자율이 다소 변하더라도 이론적으로는 자산과 부채 포트폴리오의 매칭이 대체로 유지되어야 한다. 그러나 시간이 흐르고 이자율 수준이 더욱 변하면 새로운 이자율 수준하에서는 면역화가 무너질 수 있기에 포트폴리오 리밸런싱이 필요하다. 레딩톤 면역화는 이자율의 변동이 작을 경우에만 유효하며 가정에 따른 한계점들이 존재한다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-03-08-EMH/",
    "title": "EMH",
    "description": "EMH에 대하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-03-08",
    "categories": [],
    "contents": "\r\nIntroduction\r\n보험회사는 보험계약자와 보험계약을 맺고 일정 기간동안 특정 보험사고에 대한 보상을 제공하며 그에 대한 대가로서 보험료(Premium)을 받는다. 수많은 계약자로부터 납입된 보험료는 미래의 보험사고 발생에 대한 보상액 지불, 보험회사 운용에 대한 사업비 지출 등에 쓰인다. 보험료 납입으로부터 시작된 현금흐름의 유입과 보상액, 사업비 지출로 인한 현금흐름의 유출 사이에는 시간적 차가 존재하므로 보험회사는 유입된 보험료를 바탕으로 투자활동에 나서게 되고 적정한 유동성을 유지하며 영업활동을 지속해 나간다. 그렇기에 보험회사의 재무상태표(B/S)의 자산 항목을 보면 투자된 채권과 주식의 규모를 볼 수 있다. 즉, 보험회사는 기관투자자로서 자본시장에 참여한다. 한편, 보험회사는 영업활동의 지속과 인수 위험(Risk)에 따른 버퍼(Buffer)로서 충분한 자본을 확보하고 있어야 하기에 필요시 자본시장으로부터 자본을 조달해야 하는 자금수요자로서 자본시장에 참여한다. 그러므로 자본시장을 이해해야 할 필요가 있으며 Fama(1970) 가 제시한 효율적 시장 가설에 대해 알아보도록 하자.\r\n1\r\n만약 과거 주가 시계열 자료를 분석하여 주가에 대한 예측모형이 발견되었다고 해보자. 이 예측 모형을 사용하여 현재 100인 X기업의 주가가 3일후에 200으로 상승할 것이라는 예측을 아는 투자자들은 모두 X기업의 주식을 매수하려 시도하고 이미 X기업의 주식을 보유한 투자자들은 매도하지 않는다. 이는 즉시 X기업의 주가가 200으로 상승하는 결과로 이어진다.\r\n2\r\n미래 성과에 대한 긍정적인 예측은 즉시 현재의 긍정적인 성과로 이어진다고 볼 수 있다. 더욱 일반적으로 말하면 주식의 성과 예측에 사용될 수 있는 어떠한 정보라도 주가에 이미 반영되어 있어야 한다. 현재 시점에서 이용가능한 모든 정보를 주가가 반영하고 있다면 주가는 예측 불가능한, 새로운 정보에만 변동해야 한다. 또한 주가가 예측 불가능한 정보에 변동하므로 주가 변동도 예측 불가능하다. 이것이 주가가 랜덤워크(Random Walk)를 따른다는 의미이다. 무작위적으로 움직이는 주가는 시장의 비합리성을 표현하는 것이 아니라 다른 투자자들 보다 먼저 정보를 얻으려 경쟁하는 투자자들로 인한 필연적인 결과이다. 다시 말하면 이용 가능한 모든 정보를 주가가 반영하고 있기에 랜덤워크는 그에 따른 자연스러운 결과가 되고 만약 실제로 주가의 움직임이 예측 가능하다면 이용 가능한 정보가 모두 주가에 반영되지 않았다는 의미이며 시장의 비효율성을 나타낸다. 그렇기에 현재 이용 가능한 모든 정보를 주가가 반영하고 있다는 개념을 효율적 시장 가설(Efficient Market Hypothesis)라 부른다.\r\n3\r\n효율적 시장 가설(EMH)은 세 가지의 유형으로 구분한다. 이 세 가지 유형은 모든 이용 가능한 정보의 의미에 따라 나뉜다. 약형 EMH는 모든 과거 정보가 주가에 반영되어 있음을 의미한다. 이는 과거 주가 추세를 분석하는 등의 기술적 분석(ex 차트 분석)을 통해서는 비정상적 수익을 얻을 수 없음을 말한다. 준강형 EMH는 현재 공시되거나 공개된 모든 정보가 주가에 반영되어 있음을 의미한다. 따라서 과거정보와 현재 공시 정보를 분석하는 기본적 분석(ex 재무 분석)으로는 비정상적 수익을 얻을 수 없음을 말한다. 강형 EMH는 현재 공개된 정보뿐 아니라 공개되지 않은 내부정보까지도 주가에 모두 반영되어 있음을 의미한다. 그렇기에 내부 정보를 가진 내부자들도 비정상수익을 얻을 수 없음을 말한다.\r\n4\r\n그렇다면 효율적 시장의 개념에도 불구하고 워렌 버핏, 피터 린치, 존 템플턴 등과 같은 투자업계의 슈퍼 스타들의 정상 수익률을 뛰어 넘는 탁월한 성과는 무엇인가? 이는 시장은 충분히 경쟁적이기 때문에 차별화될 만큼의 우월한 정보력이나 통찰력만이 그에 걸 맞는 보상을 받게 된다는 의미로 볼 수 있다. 다시 말하면 시장은 일반적으로 매우 효율적이지만 특별한 근면함, 지성, 창조성에 대한 보상이 여전히 기다리고 있다.\r\n5\r\n보험회사는 자본시장에서 자금공급자이자 자금수요자에 해당한다. 자금공급자로서 적절한 금융자산에 투자하여 투자 수익을 얻으려 하고 자금수요자로서 추가적인 주식 혹은 채권 발행을 통해 필요한 자금을 자본시장으로부터 조달한다. 효율적 시장 가설은 자본시장의 3가지 효율성 중 하나인 정보 효율성에 대한 이론으로서 자본시장의 참여자인 보험회사에게 투자한 증권과 자본시장에 대한 기본적 이해와 더불어 자금 조달을 위한 재무적 의사결정에 대한 밑바탕을 제공한다.\r\n6\r\n“나는 이제 증권분석의 정교한 기술이 가치 있는 주식을 찾아낼 수 있다고 주장하지 않는다 … (중략) … 옛날엔 유능한 증권 애널리스트라면 정밀한 분석을 통해 저평가 주식을 찾아내는 것이 가능하였다. 그러나 오늘날엔 많은 조사와 분석이 행해지고 있고, 이러한 노력에 대한 비용을 정당화하는 우월한 수익을 창출할 수 있을지 의문스럽다. 이와 같은 매우 제한적인 범위에서 나는 현재 교수들에 의해 지지 되고 있는 ‘효율적 시장 가설’에 동의한다” -Benjamin Graham- (INVESTMENTS, Zvi Bodie, 11th, 642p)\r\n1976년 세미나에서의 Graham의 말이다. 그레이엄은 20세기 후반 현대 포트폴리오 이론(MPT)가 탄생하기 전까지 증권 분석 분야의 유일하고 몹시 중요한 사상가이자 저자였다. 그의 저서로는 ,  등 투자업계의 스테디 셀러가 있으며 기본적 분석(Fundamental Security Analysis)를 그의 아이디어 없이는 논의할 수 없다. 가치 투자(Value Investing)의 아버지로서 불리우며 그의 제자로 워렌 버핏(Warren Buffet)이 아직도 활동 중이다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  },
  {
    "path": "posts2/2021-03-08-Hedging/",
    "title": "Hedging",
    "description": "Hedging에 대하여",
    "author": [
      {
        "name": "sonsungman",
        "url": "https://sonsungman.github.io/SKKU-Preditive.m"
      }
    ],
    "date": "2021-03-08",
    "categories": [],
    "contents": "\r\nIntroduction\r\n생명보험회사는 미래 불특정한 시점에 발생할 보험사고에 따라 약속한 보험금을 계약자에게 지불해야하는 의무를 갖는다. 그 의무는 보험회사의 재무상태표(B/S)상 책임준비금이라는 이름의 부채로 나타난다. 특히, 적립금의 투자의사결정(주식에 투자할지, 채권에 투자할지 등)을 계약자가 선택하는 변액 보험의 경우 보험회사는 최저보증옵션(GMXB)를 제공하는데 최저보증옵션 이란 예를 들어 적립금의 투자수익률이 최저보증(4%)이하로 떨어지더라도 4%의 투자수익률을 보험회사가 보장해주는 옵션을 말한다. (그 외에도 여러가지의 옵션이 존재한다.) 이러한 최저보증옵션의 제공을 위해 보험회사는 보증준비금이라는 부채를 적립한다.\r\n적립금이 주식에 투자되었을 경우 주가가 하락하면 보증 준비금으로 인해 보험회사의 부채는 크게 감소하지 않지만 자산의 규모는 줄어 들어 자본이 잠식되는 문제가 발생될 수 있다. 이때 파생상품 투자를 통해 주가 하락 시 파생상품 손익이 발생하여 자산의 감소가 크지 않다면 자본 감소가 발생하지 않을 것이다. 이와 같이 파생상품을 활용하여 주가나 금리 하락 시 자본 감소를 방지하는 것이 헷지의 기능이다. 이번 장에서는 이러한 보험회사 헷지의 기본이 되는 콜 옵션과 풋 옵션의 관계인 풋콜 패리티 식을 알아보고 이를 이용한 간단한 전략을 살펴본다.\r\n1\r\n풋콜 패리티 식은 아래와 같이 구성된다.\r\nCall-Put=PV(forward price-strike price)\r\n유럽형 옵션을 기준으로 같은 행사가와 만기를 갖는다면 콜옵션과 풋옵션 가격의 차이는 같은 만기를 갖는 포워드의 가격(Forward price)과 행사가(Strike price)의 차이의 현재 가치(PV)와 같다는 의미다.\r\n변액 상품을 구매한 계약자가 특정 주식에 적립금을 모두 투자하기로 결정했다고 가정해보자. 미래 주가 하락은 계약자의 적립금 감소를 가져오며 보험회사 자산의 감소가 발생한다. 이러한 자산의 감소를 방어할 수 있는 전략으로 보호적 풋전략을 생각해 볼 수 있다. 앞서 계약자가 투자한 특정 주식을 기초자산으로 하는 풋 옵션을 매입하게 되면 미래 주가하락에 대한 손실을 풋 옵션 행사를 통해 풋 옵션의 프리미엄만큼만 고정할 수 있어 보험회사 자산의 감소를 방어할 수 있다.\r\n2\r\n헷지에 사용하기 위해 원하는 콜 옵션 혹은 풋 옵션이 없을 때에는 풋콜 패리티 식을 활용하면 해당 파생상품과 동일한 현금흐름을 복제할 수 있다.\r\nPut=Call-PV(forward price-strike price) Put=Call+ PV(strike price)-PV(forward price)\r\n위 식을 해석해보면 동일 조건의 Call 옵션을 매입하고 PV(Strike Price) 만큼 무위험 채권에 투자하며 선불선도계약(Prepaid forward)을 매도포지션(short)에서 맺는다면 풋옵션의 현금흐름을 복제할 수 있다는 의미이다.\r\n3\r\n파생상품 거래 시장엔 원하는 기초자산과 만기를 갖는 거래상품이 많지 않기 때문에 보호적 풋 전략(기초 자산 매입 + 풋 매입) 또한 파생상품 매입을 하지 않고 같은 효과를 가지고 올 복제 전략이 필요하다. 그러므로 복제 전략에 해당하는 동적 자산배분 전략(dynamic asset allocation strategy)를 간단하게 소개하겠다.풋 옵션의 블랙숄즈 공식을 변형해보자.\r\n\\[\r\nP=Xe^{-rt} N(-d_2 )-SN(-d_1)\r\n\\] \\[\r\nP+S=Xe^{-rt} N(-d_2 )-SN(-d_1 )+S\r\n\\] \\[\r\nP+S=Xe^{-rt} N(-d_2 )+S(1-N(-d_1 ))\r\n\\] \\[\r\nP+S=Xe^{-rt} N(-d_2 )+S(N(d_1 ))\r\n\\] 가장 아래 식을 해석해보면 좌변은 보호적 풋 전략(기초 자산 매입 + 풋 매입)으로 이해할 수 있다. 우변의 앞은 무위험채권에 대한 투자, 뒤는 주식 매입을 의미한다. 정리하면 보호적 풋 전략은 주식과 무위험 채권의 매입으로 구성된 포트폴리오에서 두 자산의 편입비율을 적절히 조절함으로써 결합할 수 있다.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T14:40:55+09:00",
    "input_file": {}
  }
]
